LeanderGlanda/endstufe-esp32/src/sigmastudio/systemfiles_IC_1_REG.h
/* SOUT_SOURCE9  - Registers (IC 1) */
#define REG_SOUT_SOURCE9_IC_1_ADDR                0xF189
#define REG_SOUT_SOURCE9_IC_1_BYTE                2
#define REG_SOUT_SOURCE9_IC_1_VALUE               0xA

/* SOUT_SOURCE10  - Registers (IC 1) */
#define REG_SOUT_SOURCE10_IC_1_ADDR               0xF18A
#define REG_SOUT_SOURCE10_IC_1_BYTE               2
#define REG_SOUT_SOURCE10_IC_1_VALUE              0xB

/* SOUT_SOURCE11  - Registers (IC 1) */
#define REG_SOUT_SOURCE11_IC_1_ADDR               0xF18B
#define REG_SOUT_SOURCE11_IC_1_BYTE               2
#define REG_SOUT_SOURCE11_IC_1_VALUE              0x2

/* SOUT_SOURCE12  - Registers (IC 1) */
#define REG_SOUT_SOURCE12_IC_1_ADDR               0xF18C
#define REG_SOUT_SOURCE12_IC_1_BYTE               2
#define REG_SOUT_SOURCE12_IC_1_VALUE              0x2

/* SOUT_SOURCE13  - Registers (IC 1) */
#define REG_SOUT_SOURCE13_IC_1_ADDR               0xF18D
#define REG_SOUT_SOURCE13_IC_1_BYTE               2
#define REG_SOUT_SOURCE13_IC_1_VALUE              0x2

/* SOUT_SOURCE14  - Registers (IC 1) */
#define REG_SOUT_SOURCE14_IC_1_ADDR               0xF18E
#define REG_SOUT_SOURCE14_IC_1_BYTE               2
#define REG_SOUT_SOURCE14_IC_1_VALUE              0x2

/* SOUT_SOURCE15  - Registers (IC 1) */
#define REG_SOUT_SOURCE15_IC_1_ADDR               0xF18F
#define REG_SOUT_SOURCE15_IC_1_BYTE               2
#define REG_SOUT_SOURCE15_IC_1_VALUE              0x2

/* SOUT_SOURCE16  - Registers (IC 1) */
#define REG_SOUT_SOURCE16_IC_1_ADDR               0xF190
#define REG_SOUT_SOURCE16_IC_1_BYTE               2
#define REG_SOUT_SOURCE16_IC_1_VALUE              0x2

/* SOUT_SOURCE17  - Registers (IC 1) */
#define REG_SOUT_SOURCE17_IC_1_ADDR               0xF191
#define REG_SOUT_SOURCE17_IC_1_BYTE               2
#define REG_SOUT_SOURCE17_IC_1_VALUE              0x2

/* SOUT_SOURCE18  - Registers (IC 1) */
#define REG_SOUT_SOURCE18_IC_1_ADDR               0xF192
#define REG_SOUT_SOURCE18_IC_1_BYTE               2
#define REG_SOUT_SOURCE18_IC_1_VALUE              0x2

/* SOUT_SOURCE19  - Registers (IC 1) */
#define REG_SOUT_SOURCE19_IC_1_ADDR               0xF193
#define REG_SOUT_SOURCE19_IC_1_BYTE               2
#define REG_SOUT_SOURCE19_IC_1_VALUE              0x2

/* SOUT_SOURCE20  - Registers (IC 1) */
#define REG_SOUT_SOURCE20_IC_1_ADDR               0xF194
#define REG_SOUT_SOURCE20_IC_1_BYTE               2
#define REG_SOUT_SOURCE20_IC_1_VALUE              0x2

/* SOUT_SOURCE21  - Registers (IC 1) */
#define REG_SOUT_SOURCE21_IC_1_ADDR               0xF195
#define REG_SOUT_SOURCE21_IC_1_BYTE               2
#define REG_SOUT_SOURCE21_IC_1_VALUE              0x2

/* SOUT_SOURCE22  - Registers (IC 1) */
#define REG_SOUT_SOURCE22_IC_1_ADDR               0xF196
#define REG_SOUT_SOURCE22_IC_1_BYTE               2
#define REG_SOUT_SOURCE22_IC_1_VALUE              0x2

/* SOUT_SOURCE23  - Registers (IC 1) */
#define REG_SOUT_SOURCE23_IC_1_ADDR               0xF197
#define REG_SOUT_SOURCE23_IC_1_BYTE               2
#define REG_SOUT_SOURCE23_IC_1_VALUE              0x2

/* SPDIFTX_INPUT  - Registers (IC 1) */
#define REG_SPDIFTX_INPUT_IC_1_ADDR               0xF1C0
#define REG_SPDIFTX_INPUT_IC_1_BYTE               2
#define REG_SPDIFTX_INPUT_IC_1_VALUE              0x0

/* SERIAL_BYTE_0_0  - Registers (IC 1) */
#define REG_SERIAL_BYTE_0_0_IC_1_ADDR             0xF200
#define REG_SERIAL_BYTE_0_0_IC_1_BYTE             2
#define REG_SERIAL_BYTE_0_0_IC_1_VALUE            0x25

/* SERIAL_BYTE_0_1  - Registers (IC 1) */
#define REG_SERIAL_BYTE_0_1_IC_1_ADDR             0xF201
#define REG_SERIAL_BYTE_0_1_IC_1_BYTE             2
#define REG_SERIAL_BYTE_0_1_IC_1_VALUE            0x0

/* SERIAL_BYTE_1_0  - Registers (IC 1) */
#define REG_SERIAL_BYTE_1_0_IC_1_ADDR             0xF204
#define REG_SERIAL_BYTE_1_0_IC_1_BYTE             2
#define REG_SERIAL_BYTE_1_0_IC_1_VALUE            0x20

/* SERIAL_BYTE_1_1  - Registers (IC 1) */
#define REG_SERIAL_BYTE_1_1_IC_1_ADDR             0xF205
#define REG_SERIAL_BYTE_1_1_IC_1_BYTE             2
#define REG_SERIAL_BYTE_1_1_IC_1_VALUE            0x0

/* SERIAL_BYTE_2_0  - Registers (IC 1) */
#define REG_SERIAL_BYTE_2_0_IC_1_ADDR             0xF208
#define REG_SERIAL_BYTE_2_0_IC_1_BYTE             2
#define REG_SERIAL_BYTE_2_0_IC_1_VALUE            0x9000

/* SERIAL_BYTE_2_1  - Registers (IC 1) */
#define REG_SERIAL_BYTE_2_1_IC_1_ADDR             0xF209
#define REG_SERIAL_BYTE_2_1_IC_1_BYTE             2
#define REG_SERIAL_BYTE_2_1_IC_1_VALUE            0x2

/* SERIAL_BYTE_3_0  - Registers (IC 1) */
#define REG_SERIAL_BYTE_3_0_IC_1_ADDR             0xF20C
#define REG_SERIAL_BYTE_3_0_IC_1_BYTE             2
#define REG_SERIAL_BYTE_3_0_IC_1_VALUE            0x6C00

/* SERIAL_BYTE_3_1  - Registers (IC 1) */
#define REG_SERIAL_BYTE_3_1_IC_1_ADDR             0xF20D
#define REG_SERIAL_BYTE_3_1_IC_1_BYTE             2
#define REG_SERIAL_BYTE_3_1_IC_1_VALUE            0x2

/* SERIAL_BYTE_4_0  - Registers (IC 1) */
#define REG_SERIAL_BYTE_4_0_IC_1_ADDR             0xF210
#define REG_SERIAL_BYTE_4_0_IC_1_BYTE             2
#define REG_SERIAL_BYTE_4_0_IC_1_VALUE            0x9000

/* SERIAL_BYTE_4_1  - Registers (IC 1) */
#define REG_SERIAL_BYTE_4_1_IC_1_ADDR             0xF211
#define REG_SERIAL_BYTE_4_1_IC_1_BYTE             2
#define REG_SERIAL_BYTE_4_1_IC_1_VALUE            0x2

/* SERIAL_BYTE_5_0  - Registers (IC 1) */
#define REG_SERIAL_BYTE_5_0_IC_1_ADDR             0xF214
#define REG_SERIAL_BYTE_5_0_IC_1_BYTE             2
#define REG_SERIAL_BYTE_5_0_IC_1_VALUE            0x2400

/* SERIAL_BYTE_5_1  - Registers (IC 1) */
#define REG_SERIAL_BYTE_5_1_IC_1_ADDR             0xF215
#define REG_SERIAL_BYTE_5_1_IC_1_BYTE             2
#define REG_SERIAL_BYTE_5_1_IC_1_VALUE            0x2

/* SERIAL_BYTE_6_0  - Registers (IC 1) */
#define REG_SERIAL_BYTE_6_0_IC_1_ADDR             0xF218
#define REG_SERIAL_BYTE_6_0_IC_1_BYTE             2
#define REG_SERIAL_BYTE_6_0_IC_1_VALUE            0x9000

/* SERIAL_BYTE_6_1  - Registers (IC 1) */
#define REG_SERIAL_BYTE_6_1_IC_1_ADDR             0xF219
#define REG_SERIAL_BYTE_6_1_IC_1_BYTE             2
#define REG_SERIAL_BYTE_6_1_IC_1_VALUE            0x2

/* SERIAL_BYTE_7_0  - Registers (IC 1) */
#define REG_SERIAL_BYTE_7_0_IC_1_ADDR             0xF21C
#define REG_SERIAL_BYTE_7_0_IC_1_BYTE             2
#define REG_SERIAL_BYTE_7_0_IC_1_VALUE            0x9000

