LeanderGlanda/endstufe-esp32/src/sigmastudio/systemfiles_IC_1_REG.h
/* FTDM_IN58  - Registers (IC 1) */
#define REG_FTDM_IN58_IC_1_ADDR                   0xF33A
#define REG_FTDM_IN58_IC_1_BYTE                   2
#define REG_FTDM_IN58_IC_1_VALUE                  0x0

/* FTDM_IN59  - Registers (IC 1) */
#define REG_FTDM_IN59_IC_1_ADDR                   0xF33B
#define REG_FTDM_IN59_IC_1_BYTE                   2
#define REG_FTDM_IN59_IC_1_VALUE                  0x0

/* FTDM_IN60  - Registers (IC 1) */
#define REG_FTDM_IN60_IC_1_ADDR                   0xF33C
#define REG_FTDM_IN60_IC_1_BYTE                   2
#define REG_FTDM_IN60_IC_1_VALUE                  0x0

/* FTDM_IN61  - Registers (IC 1) */
#define REG_FTDM_IN61_IC_1_ADDR                   0xF33D
#define REG_FTDM_IN61_IC_1_BYTE                   2
#define REG_FTDM_IN61_IC_1_VALUE                  0x0

/* FTDM_IN62  - Registers (IC 1) */
#define REG_FTDM_IN62_IC_1_ADDR                   0xF33E
#define REG_FTDM_IN62_IC_1_BYTE                   2
#define REG_FTDM_IN62_IC_1_VALUE                  0x0

/* FTDM_IN63  - Registers (IC 1) */
#define REG_FTDM_IN63_IC_1_ADDR                   0xF33F
#define REG_FTDM_IN63_IC_1_BYTE                   2
#define REG_FTDM_IN63_IC_1_VALUE                  0x0

/* FTDM_OUT0  - Registers (IC 1) */
#define REG_FTDM_OUT0_IC_1_ADDR                   0xF380
#define REG_FTDM_OUT0_IC_1_BYTE                   2
#define REG_FTDM_OUT0_IC_1_VALUE                  0x0

/* FTDM_OUT1  - Registers (IC 1) */
#define REG_FTDM_OUT1_IC_1_ADDR                   0xF381
#define REG_FTDM_OUT1_IC_1_BYTE                   2
#define REG_FTDM_OUT1_IC_1_VALUE                  0x0

/* FTDM_OUT2  - Registers (IC 1) */
#define REG_FTDM_OUT2_IC_1_ADDR                   0xF382
#define REG_FTDM_OUT2_IC_1_BYTE                   2
#define REG_FTDM_OUT2_IC_1_VALUE                  0x0

/* FTDM_OUT3  - Registers (IC 1) */
#define REG_FTDM_OUT3_IC_1_ADDR                   0xF383
#define REG_FTDM_OUT3_IC_1_BYTE                   2
#define REG_FTDM_OUT3_IC_1_VALUE                  0x0

/* FTDM_OUT4  - Registers (IC 1) */
#define REG_FTDM_OUT4_IC_1_ADDR                   0xF384
#define REG_FTDM_OUT4_IC_1_BYTE                   2
#define REG_FTDM_OUT4_IC_1_VALUE                  0x0

/* FTDM_OUT5  - Registers (IC 1) */
#define REG_FTDM_OUT5_IC_1_ADDR                   0xF385
#define REG_FTDM_OUT5_IC_1_BYTE                   2
#define REG_FTDM_OUT5_IC_1_VALUE                  0x0

/* FTDM_OUT6  - Registers (IC 1) */
#define REG_FTDM_OUT6_IC_1_ADDR                   0xF386
#define REG_FTDM_OUT6_IC_1_BYTE                   2
#define REG_FTDM_OUT6_IC_1_VALUE                  0x0

/* FTDM_OUT7  - Registers (IC 1) */
#define REG_FTDM_OUT7_IC_1_ADDR                   0xF387
#define REG_FTDM_OUT7_IC_1_BYTE                   2
#define REG_FTDM_OUT7_IC_1_VALUE                  0x0

/* FTDM_OUT8  - Registers (IC 1) */
#define REG_FTDM_OUT8_IC_1_ADDR                   0xF388
#define REG_FTDM_OUT8_IC_1_BYTE                   2
#define REG_FTDM_OUT8_IC_1_VALUE                  0x0

/* FTDM_OUT9  - Registers (IC 1) */
#define REG_FTDM_OUT9_IC_1_ADDR                   0xF389
#define REG_FTDM_OUT9_IC_1_BYTE                   2
#define REG_FTDM_OUT9_IC_1_VALUE                  0x0

/* FTDM_OUT10  - Registers (IC 1) */
#define REG_FTDM_OUT10_IC_1_ADDR                  0xF38A
#define REG_FTDM_OUT10_IC_1_BYTE                  2
#define REG_FTDM_OUT10_IC_1_VALUE                 0x0

/* FTDM_OUT11  - Registers (IC 1) */
#define REG_FTDM_OUT11_IC_1_ADDR                  0xF38B
#define REG_FTDM_OUT11_IC_1_BYTE                  2
#define REG_FTDM_OUT11_IC_1_VALUE                 0x0

/* FTDM_OUT12  - Registers (IC 1) */
#define REG_FTDM_OUT12_IC_1_ADDR                  0xF38C
#define REG_FTDM_OUT12_IC_1_BYTE                  2
#define REG_FTDM_OUT12_IC_1_VALUE                 0x0

/* FTDM_OUT13  - Registers (IC 1) */
#define REG_FTDM_OUT13_IC_1_ADDR                  0xF38D
#define REG_FTDM_OUT13_IC_1_BYTE                  2
#define REG_FTDM_OUT13_IC_1_VALUE                 0x0

/* FTDM_OUT14  - Registers (IC 1) */
#define REG_FTDM_OUT14_IC_1_ADDR                  0xF38E
#define REG_FTDM_OUT14_IC_1_BYTE                  2
#define REG_FTDM_OUT14_IC_1_VALUE                 0x0

/* FTDM_OUT15  - Registers (IC 1) */
#define REG_FTDM_OUT15_IC_1_ADDR                  0xF38F
#define REG_FTDM_OUT15_IC_1_BYTE                  2
#define REG_FTDM_OUT15_IC_1_VALUE                 0x0

/* FTDM_OUT16  - Registers (IC 1) */
#define REG_FTDM_OUT16_IC_1_ADDR                  0xF390
#define REG_FTDM_OUT16_IC_1_BYTE                  2
#define REG_FTDM_OUT16_IC_1_VALUE                 0x0

/* FTDM_OUT17  - Registers (IC 1) */
#define REG_FTDM_OUT17_IC_1_ADDR                  0xF391
#define REG_FTDM_OUT17_IC_1_BYTE                  2
#define REG_FTDM_OUT17_IC_1_VALUE                 0x0

/* FTDM_OUT18  - Registers (IC 1) */
#define REG_FTDM_OUT18_IC_1_ADDR                  0xF392
#define REG_FTDM_OUT18_IC_1_BYTE                  2
#define REG_FTDM_OUT18_IC_1_VALUE                 0x0

/* FTDM_OUT19  - Registers (IC 1) */
#define REG_FTDM_OUT19_IC_1_ADDR                  0xF393
#define REG_FTDM_OUT19_IC_1_BYTE                  2
#define REG_FTDM_OUT19_IC_1_VALUE                 0x0

/* FTDM_OUT20  - Registers (IC 1) */
#define REG_FTDM_OUT20_IC_1_ADDR                  0xF394
#define REG_FTDM_OUT20_IC_1_BYTE                  2
#define REG_FTDM_OUT20_IC_1_VALUE                 0x0

/* FTDM_OUT21  - Registers (IC 1) */
#define REG_FTDM_OUT21_IC_1_ADDR                  0xF395
#define REG_FTDM_OUT21_IC_1_BYTE                  2
#define REG_FTDM_OUT21_IC_1_VALUE                 0x0

/* FTDM_OUT22  - Registers (IC 1) */
#define REG_FTDM_OUT22_IC_1_ADDR                  0xF396
#define REG_FTDM_OUT22_IC_1_BYTE                  2
#define REG_FTDM_OUT22_IC_1_VALUE                 0x0

/* FTDM_OUT23  - Registers (IC 1) */
#define REG_FTDM_OUT23_IC_1_ADDR                  0xF397
#define REG_FTDM_OUT23_IC_1_BYTE                  2
#define REG_FTDM_OUT23_IC_1_VALUE                 0x0

/* FTDM_OUT24  - Registers (IC 1) */
#define REG_FTDM_OUT24_IC_1_ADDR                  0xF398
#define REG_FTDM_OUT24_IC_1_BYTE                  2
#define REG_FTDM_OUT24_IC_1_VALUE                 0x0

/* FTDM_OUT25  - Registers (IC 1) */
#define REG_FTDM_OUT25_IC_1_ADDR                  0xF399
#define REG_FTDM_OUT25_IC_1_BYTE                  2
#define REG_FTDM_OUT25_IC_1_VALUE                 0x0

/* FTDM_OUT26  - Registers (IC 1) */
#define REG_FTDM_OUT26_IC_1_ADDR                  0xF39A
#define REG_FTDM_OUT26_IC_1_BYTE                  2
#define REG_FTDM_OUT26_IC_1_VALUE                 0x0

/* FTDM_OUT27  - Registers (IC 1) */
#define REG_FTDM_OUT27_IC_1_ADDR                  0xF39B
#define REG_FTDM_OUT27_IC_1_BYTE                  2
#define REG_FTDM_OUT27_IC_1_VALUE                 0x0

/* FTDM_OUT28  - Registers (IC 1) */
#define REG_FTDM_OUT28_IC_1_ADDR                  0xF39C
#define REG_FTDM_OUT28_IC_1_BYTE                  2
#define REG_FTDM_OUT28_IC_1_VALUE                 0x0

