LeanderGlanda/endstufe-esp32/src/sigmastudio/systemfiles_IC_1_REG.h
/* CLK_GEN3_LOCK (IC 1) */
#define R14_CLK_GEN3_LOCK_GEN3_LOCK_IC_1          0x0    /* 0b	[0] */
#define R14_CLK_GEN3_LOCK_GEN3_LOCK_IC_1_MASK     0x1
#define R14_CLK_GEN3_LOCK_GEN3_LOCK_IC_1_SHIFT    0

/* POWER_ENABLE0 (IC 1) */
#define R15_POWER_ENABLE0_SIN0_PWR_IC_1           0x1    /* 1b	[0] */
#define R15_POWER_ENABLE0_SIN1_PWR_IC_1           0x1    /* 1b	[1] */
#define R15_POWER_ENABLE0_SIN2_PWR_IC_1           0x1    /* 1b	[2] */
#define R15_POWER_ENABLE0_SIN3_PWR_IC_1           0x1    /* 1b	[3] */
#define R15_POWER_ENABLE0_SOUT0_PWR_IC_1          0x1    /* 1b	[4] */
#define R15_POWER_ENABLE0_SOUT1_PWR_IC_1          0x1    /* 1b	[5] */
#define R15_POWER_ENABLE0_SOUT2_PWR_IC_1          0x1    /* 1b	[6] */
#define R15_POWER_ENABLE0_SOUT3_PWR_IC_1          0x1    /* 1b	[7] */
#define R15_POWER_ENABLE0_ASRCBANK0_PWR_IC_1      0x1    /* 1b	[8] */
#define R15_POWER_ENABLE0_ASRCBANK1_PWR_IC_1      0x1    /* 1b	[9] */
#define R15_POWER_ENABLE0_CLK_GEN1_PWR_IC_1       0x1    /* 1b	[10] */
#define R15_POWER_ENABLE0_CLK_GEN2_PWR_IC_1       0x1    /* 1b	[11] */
#define R15_POWER_ENABLE0_CLK_GEN3_PWR_IC_1       0x1    /* 1b	[12] */
#define R15_POWER_ENABLE0_SIN0_PWR_IC_1_MASK      0x1
#define R15_POWER_ENABLE0_SIN0_PWR_IC_1_SHIFT     0
#define R15_POWER_ENABLE0_SIN1_PWR_IC_1_MASK      0x2
#define R15_POWER_ENABLE0_SIN1_PWR_IC_1_SHIFT     1
#define R15_POWER_ENABLE0_SIN2_PWR_IC_1_MASK      0x4
#define R15_POWER_ENABLE0_SIN2_PWR_IC_1_SHIFT     2
#define R15_POWER_ENABLE0_SIN3_PWR_IC_1_MASK      0x8
#define R15_POWER_ENABLE0_SIN3_PWR_IC_1_SHIFT     3
#define R15_POWER_ENABLE0_SOUT0_PWR_IC_1_MASK     0x10
#define R15_POWER_ENABLE0_SOUT0_PWR_IC_1_SHIFT    4
#define R15_POWER_ENABLE0_SOUT1_PWR_IC_1_MASK     0x20
#define R15_POWER_ENABLE0_SOUT1_PWR_IC_1_SHIFT    5
#define R15_POWER_ENABLE0_SOUT2_PWR_IC_1_MASK     0x40
#define R15_POWER_ENABLE0_SOUT2_PWR_IC_1_SHIFT    6
#define R15_POWER_ENABLE0_SOUT3_PWR_IC_1_MASK     0x80
#define R15_POWER_ENABLE0_SOUT3_PWR_IC_1_SHIFT    7
#define R15_POWER_ENABLE0_ASRCBANK0_PWR_IC_1_MASK 0x100
#define R15_POWER_ENABLE0_ASRCBANK0_PWR_IC_1_SHIFT 8
#define R15_POWER_ENABLE0_ASRCBANK1_PWR_IC_1_MASK 0x200
#define R15_POWER_ENABLE0_ASRCBANK1_PWR_IC_1_SHIFT 9
#define R15_POWER_ENABLE0_CLK_GEN1_PWR_IC_1_MASK  0x400
#define R15_POWER_ENABLE0_CLK_GEN1_PWR_IC_1_SHIFT 10
#define R15_POWER_ENABLE0_CLK_GEN2_PWR_IC_1_MASK  0x800
#define R15_POWER_ENABLE0_CLK_GEN2_PWR_IC_1_SHIFT 11
#define R15_POWER_ENABLE0_CLK_GEN3_PWR_IC_1_MASK  0x1000
#define R15_POWER_ENABLE0_CLK_GEN3_PWR_IC_1_SHIFT 12

/* POWER_ENABLE1 (IC 1) */
#define R16_POWER_ENABLE1_ADC_PWR_IC_1            0x1    /* 1b	[0] */
#define R16_POWER_ENABLE1_RX_PWR_IC_1             0x1    /* 1b	[1] */
#define R16_POWER_ENABLE1_TX_PWR_IC_1             0x1    /* 1b	[2] */
#define R16_POWER_ENABLE1_PDM0_PWR_IC_1           0x1    /* 1b	[3] */
#define R16_POWER_ENABLE1_PDM1_PWR_IC_1           0x1    /* 1b	[4] */
#define R16_POWER_ENABLE1_ADC_PWR_IC_1_MASK       0x1
#define R16_POWER_ENABLE1_ADC_PWR_IC_1_SHIFT      0
#define R16_POWER_ENABLE1_RX_PWR_IC_1_MASK        0x2
#define R16_POWER_ENABLE1_RX_PWR_IC_1_SHIFT       1
#define R16_POWER_ENABLE1_TX_PWR_IC_1_MASK        0x4
#define R16_POWER_ENABLE1_TX_PWR_IC_1_SHIFT       2
#define R16_POWER_ENABLE1_PDM0_PWR_IC_1_MASK      0x8
#define R16_POWER_ENABLE1_PDM0_PWR_IC_1_SHIFT     3
#define R16_POWER_ENABLE1_PDM1_PWR_IC_1_MASK      0x10
#define R16_POWER_ENABLE1_PDM1_PWR_IC_1_SHIFT     4

/* ASRC_INPUT0 (IC 1) */
#define R17_ASRC_INPUT0_ASRC_SOURCE_IC_1          0x2    /* 010b	[2:0] */
#define R17_ASRC_INPUT0_ASRC_SIN_CHANNEL_IC_1     0x0    /* 00000b	[7:3] */
#define R17_ASRC_INPUT0_ASRC_SOURCE_IC_1_MASK     0x7
#define R17_ASRC_INPUT0_ASRC_SOURCE_IC_1_SHIFT    0
#define R17_ASRC_INPUT0_ASRC_SIN_CHANNEL_IC_1_MASK 0xF8
#define R17_ASRC_INPUT0_ASRC_SIN_CHANNEL_IC_1_SHIFT 3

/* ASRC_INPUT1 (IC 1) */
#define R18_ASRC_INPUT1_ASRC_SOURCE_IC_1          0x2    /* 010b	[2:0] */
#define R18_ASRC_INPUT1_ASRC_SIN_CHANNEL_IC_1     0x1    /* 00001b	[7:3] */
#define R18_ASRC_INPUT1_ASRC_SOURCE_IC_1_MASK     0x7
#define R18_ASRC_INPUT1_ASRC_SOURCE_IC_1_SHIFT    0
#define R18_ASRC_INPUT1_ASRC_SIN_CHANNEL_IC_1_MASK 0xF8
#define R18_ASRC_INPUT1_ASRC_SIN_CHANNEL_IC_1_SHIFT 3

/* ASRC_INPUT2 (IC 1) */
#define R19_ASRC_INPUT2_ASRC_SOURCE_IC_1          0x1    /* 001b	[2:0] */
#define R19_ASRC_INPUT2_ASRC_SIN_CHANNEL_IC_1     0x0    /* 00000b	[7:3] */
#define R19_ASRC_INPUT2_ASRC_SOURCE_IC_1_MASK     0x7
#define R19_ASRC_INPUT2_ASRC_SOURCE_IC_1_SHIFT    0
#define R19_ASRC_INPUT2_ASRC_SIN_CHANNEL_IC_1_MASK 0xF8
#define R19_ASRC_INPUT2_ASRC_SIN_CHANNEL_IC_1_SHIFT 3

/* ASRC_INPUT3 (IC 1) */
#define R20_ASRC_INPUT3_ASRC_SOURCE_IC_1          0x0    /* 000b	[2:0] */
#define R20_ASRC_INPUT3_ASRC_SIN_CHANNEL_IC_1     0x0    /* 00000b	[7:3] */
#define R20_ASRC_INPUT3_ASRC_SOURCE_IC_1_MASK     0x7
#define R20_ASRC_INPUT3_ASRC_SOURCE_IC_1_SHIFT    0
#define R20_ASRC_INPUT3_ASRC_SIN_CHANNEL_IC_1_MASK 0xF8
#define R20_ASRC_INPUT3_ASRC_SIN_CHANNEL_IC_1_SHIFT 3

/* ASRC_INPUT4 (IC 1) */
#define R21_ASRC_INPUT4_ASRC_SOURCE_IC_1          0x0    /* 000b	[2:0] */
#define R21_ASRC_INPUT4_ASRC_SIN_CHANNEL_IC_1     0x0    /* 00000b	[7:3] */
#define R21_ASRC_INPUT4_ASRC_SOURCE_IC_1_MASK     0x7
#define R21_ASRC_INPUT4_ASRC_SOURCE_IC_1_SHIFT    0
#define R21_ASRC_INPUT4_ASRC_SIN_CHANNEL_IC_1_MASK 0xF8
#define R21_ASRC_INPUT4_ASRC_SIN_CHANNEL_IC_1_SHIFT 3

/* ASRC_INPUT5 (IC 1) */
#define R22_ASRC_INPUT5_ASRC_SOURCE_IC_1          0x0    /* 000b	[2:0] */
#define R22_ASRC_INPUT5_ASRC_SIN_CHANNEL_IC_1     0x0    /* 00000b	[7:3] */
#define R22_ASRC_INPUT5_ASRC_SOURCE_IC_1_MASK     0x7
#define R22_ASRC_INPUT5_ASRC_SOURCE_IC_1_SHIFT    0
#define R22_ASRC_INPUT5_ASRC_SIN_CHANNEL_IC_1_MASK 0xF8
#define R22_ASRC_INPUT5_ASRC_SIN_CHANNEL_IC_1_SHIFT 3

/* ASRC_INPUT6 (IC 1) */
#define R23_ASRC_INPUT6_ASRC_SOURCE_IC_1          0x0    /* 000b	[2:0] */
#define R23_ASRC_INPUT6_ASRC_SIN_CHANNEL_IC_1     0x0    /* 00000b	[7:3] */
#define R23_ASRC_INPUT6_ASRC_SOURCE_IC_1_MASK     0x7
#define R23_ASRC_INPUT6_ASRC_SOURCE_IC_1_SHIFT    0
#define R23_ASRC_INPUT6_ASRC_SIN_CHANNEL_IC_1_MASK 0xF8
#define R23_ASRC_INPUT6_ASRC_SIN_CHANNEL_IC_1_SHIFT 3

/* ASRC_INPUT7 (IC 1) */
#define R24_ASRC_INPUT7_ASRC_SOURCE_IC_1          0x0    /* 000b	[2:0] */
#define R24_ASRC_INPUT7_ASRC_SIN_CHANNEL_IC_1     0x0    /* 00000b	[7:3] */
#define R24_ASRC_INPUT7_ASRC_SOURCE_IC_1_MASK     0x7
#define R24_ASRC_INPUT7_ASRC_SOURCE_IC_1_SHIFT    0
#define R24_ASRC_INPUT7_ASRC_SIN_CHANNEL_IC_1_MASK 0xF8
#define R24_ASRC_INPUT7_ASRC_SIN_CHANNEL_IC_1_SHIFT 3

