LeanderGlanda/endstufe-esp32/src/sigmastudio/systemfiles_IC_1_REG.h
/* SERIAL_BYTE_5_0 (IC 1) */
#define R68_SERIAL_BYTE_5_0_TDM_MODE_IC_1         0x0    /* 000b	[2:0] */
#define R68_SERIAL_BYTE_5_0_DATA_FMT_IC_1         0x0    /* 00b	[4:3] */
#define R68_SERIAL_BYTE_5_0_WORD_LEN_IC_1         0x0    /* 00b	[6:5] */
#define R68_SERIAL_BYTE_5_0_BCLK_POL_IC_1         0x0    /* 0b	[7] */
#define R68_SERIAL_BYTE_5_0_LRCLK_POL_IC_1        0x0    /* 0b	[8] */
#define R68_SERIAL_BYTE_5_0_LRCLK_MODE_IC_1       0x0    /* 0b	[9] */
#define R68_SERIAL_BYTE_5_0_BCLK_SRC_IC_1         0x1    /* 001b	[12:10] */
#define R68_SERIAL_BYTE_5_0_LRCLK_SRC_IC_1        0x1    /* 001b	[15:13] */
#define R68_SERIAL_BYTE_5_0_TDM_MODE_IC_1_MASK    0x7
#define R68_SERIAL_BYTE_5_0_TDM_MODE_IC_1_SHIFT   0
#define R68_SERIAL_BYTE_5_0_DATA_FMT_IC_1_MASK    0x18
#define R68_SERIAL_BYTE_5_0_DATA_FMT_IC_1_SHIFT   3
#define R68_SERIAL_BYTE_5_0_WORD_LEN_IC_1_MASK    0x60
#define R68_SERIAL_BYTE_5_0_WORD_LEN_IC_1_SHIFT   5
#define R68_SERIAL_BYTE_5_0_BCLK_POL_IC_1_MASK    0x80
#define R68_SERIAL_BYTE_5_0_BCLK_POL_IC_1_SHIFT   7
#define R68_SERIAL_BYTE_5_0_LRCLK_POL_IC_1_MASK   0x100
#define R68_SERIAL_BYTE_5_0_LRCLK_POL_IC_1_SHIFT  8
#define R68_SERIAL_BYTE_5_0_LRCLK_MODE_IC_1_MASK  0x200
#define R68_SERIAL_BYTE_5_0_LRCLK_MODE_IC_1_SHIFT 9
#define R68_SERIAL_BYTE_5_0_BCLK_SRC_IC_1_MASK    0x1C00
#define R68_SERIAL_BYTE_5_0_BCLK_SRC_IC_1_SHIFT   10
#define R68_SERIAL_BYTE_5_0_LRCLK_SRC_IC_1_MASK   0xE000
#define R68_SERIAL_BYTE_5_0_LRCLK_SRC_IC_1_SHIFT  13

/* SERIAL_BYTE_5_1 (IC 1) */
#define R69_SERIAL_BYTE_5_1_FS_IC_1               0x2    /* 010b	[2:0] */
#define R69_SERIAL_BYTE_5_1_CLK_DOMAIN_IC_1       0x0    /* 00b	[4:3] */
#define R69_SERIAL_BYTE_5_1_TRISTATE_IC_1         0x0    /* 0b	[5] */
#define R69_SERIAL_BYTE_5_1_FS_IC_1_MASK          0x7
#define R69_SERIAL_BYTE_5_1_FS_IC_1_SHIFT         0
#define R69_SERIAL_BYTE_5_1_CLK_DOMAIN_IC_1_MASK  0x18
#define R69_SERIAL_BYTE_5_1_CLK_DOMAIN_IC_1_SHIFT 3
#define R69_SERIAL_BYTE_5_1_TRISTATE_IC_1_MASK    0x20
#define R69_SERIAL_BYTE_5_1_TRISTATE_IC_1_SHIFT   5

/* SERIAL_BYTE_6_0 (IC 1) */
#define R70_SERIAL_BYTE_6_0_TDM_MODE_IC_1         0x0    /* 000b	[2:0] */
#define R70_SERIAL_BYTE_6_0_DATA_FMT_IC_1         0x0    /* 00b	[4:3] */
#define R70_SERIAL_BYTE_6_0_WORD_LEN_IC_1         0x0    /* 00b	[6:5] */
#define R70_SERIAL_BYTE_6_0_BCLK_POL_IC_1         0x0    /* 0b	[7] */
#define R70_SERIAL_BYTE_6_0_LRCLK_POL_IC_1        0x0    /* 0b	[8] */
#define R70_SERIAL_BYTE_6_0_LRCLK_MODE_IC_1       0x0    /* 0b	[9] */
#define R70_SERIAL_BYTE_6_0_BCLK_SRC_IC_1         0x4    /* 100b	[12:10] */
#define R70_SERIAL_BYTE_6_0_LRCLK_SRC_IC_1        0x4    /* 100b	[15:13] */
#define R70_SERIAL_BYTE_6_0_TDM_MODE_IC_1_MASK    0x7
#define R70_SERIAL_BYTE_6_0_TDM_MODE_IC_1_SHIFT   0
#define R70_SERIAL_BYTE_6_0_DATA_FMT_IC_1_MASK    0x18
#define R70_SERIAL_BYTE_6_0_DATA_FMT_IC_1_SHIFT   3
#define R70_SERIAL_BYTE_6_0_WORD_LEN_IC_1_MASK    0x60
#define R70_SERIAL_BYTE_6_0_WORD_LEN_IC_1_SHIFT   5
#define R70_SERIAL_BYTE_6_0_BCLK_POL_IC_1_MASK    0x80
#define R70_SERIAL_BYTE_6_0_BCLK_POL_IC_1_SHIFT   7
#define R70_SERIAL_BYTE_6_0_LRCLK_POL_IC_1_MASK   0x100
#define R70_SERIAL_BYTE_6_0_LRCLK_POL_IC_1_SHIFT  8
#define R70_SERIAL_BYTE_6_0_LRCLK_MODE_IC_1_MASK  0x200
#define R70_SERIAL_BYTE_6_0_LRCLK_MODE_IC_1_SHIFT 9
#define R70_SERIAL_BYTE_6_0_BCLK_SRC_IC_1_MASK    0x1C00
#define R70_SERIAL_BYTE_6_0_BCLK_SRC_IC_1_SHIFT   10
#define R70_SERIAL_BYTE_6_0_LRCLK_SRC_IC_1_MASK   0xE000
#define R70_SERIAL_BYTE_6_0_LRCLK_SRC_IC_1_SHIFT  13

/* SERIAL_BYTE_6_1 (IC 1) */
#define R71_SERIAL_BYTE_6_1_FS_IC_1               0x2    /* 010b	[2:0] */
#define R71_SERIAL_BYTE_6_1_CLK_DOMAIN_IC_1       0x0    /* 00b	[4:3] */
#define R71_SERIAL_BYTE_6_1_TRISTATE_IC_1         0x0    /* 0b	[5] */
#define R71_SERIAL_BYTE_6_1_FS_IC_1_MASK          0x7
#define R71_SERIAL_BYTE_6_1_FS_IC_1_SHIFT         0
#define R71_SERIAL_BYTE_6_1_CLK_DOMAIN_IC_1_MASK  0x18
#define R71_SERIAL_BYTE_6_1_CLK_DOMAIN_IC_1_SHIFT 3
#define R71_SERIAL_BYTE_6_1_TRISTATE_IC_1_MASK    0x20
#define R71_SERIAL_BYTE_6_1_TRISTATE_IC_1_SHIFT   5

/* SERIAL_BYTE_7_0 (IC 1) */
#define R72_SERIAL_BYTE_7_0_TDM_MODE_IC_1         0x0    /* 000b	[2:0] */
#define R72_SERIAL_BYTE_7_0_DATA_FMT_IC_1         0x0    /* 00b	[4:3] */
#define R72_SERIAL_BYTE_7_0_WORD_LEN_IC_1         0x0    /* 00b	[6:5] */
#define R72_SERIAL_BYTE_7_0_BCLK_POL_IC_1         0x0    /* 0b	[7] */
#define R72_SERIAL_BYTE_7_0_LRCLK_POL_IC_1        0x0    /* 0b	[8] */
#define R72_SERIAL_BYTE_7_0_LRCLK_MODE_IC_1       0x0    /* 0b	[9] */
#define R72_SERIAL_BYTE_7_0_BCLK_SRC_IC_1         0x4    /* 100b	[12:10] */
#define R72_SERIAL_BYTE_7_0_LRCLK_SRC_IC_1        0x4    /* 100b	[15:13] */
#define R72_SERIAL_BYTE_7_0_TDM_MODE_IC_1_MASK    0x7
#define R72_SERIAL_BYTE_7_0_TDM_MODE_IC_1_SHIFT   0
#define R72_SERIAL_BYTE_7_0_DATA_FMT_IC_1_MASK    0x18
#define R72_SERIAL_BYTE_7_0_DATA_FMT_IC_1_SHIFT   3
#define R72_SERIAL_BYTE_7_0_WORD_LEN_IC_1_MASK    0x60
#define R72_SERIAL_BYTE_7_0_WORD_LEN_IC_1_SHIFT   5
#define R72_SERIAL_BYTE_7_0_BCLK_POL_IC_1_MASK    0x80
#define R72_SERIAL_BYTE_7_0_BCLK_POL_IC_1_SHIFT   7
#define R72_SERIAL_BYTE_7_0_LRCLK_POL_IC_1_MASK   0x100
#define R72_SERIAL_BYTE_7_0_LRCLK_POL_IC_1_SHIFT  8
#define R72_SERIAL_BYTE_7_0_LRCLK_MODE_IC_1_MASK  0x200
#define R72_SERIAL_BYTE_7_0_LRCLK_MODE_IC_1_SHIFT 9
#define R72_SERIAL_BYTE_7_0_BCLK_SRC_IC_1_MASK    0x1C00
#define R72_SERIAL_BYTE_7_0_BCLK_SRC_IC_1_SHIFT   10
#define R72_SERIAL_BYTE_7_0_LRCLK_SRC_IC_1_MASK   0xE000
#define R72_SERIAL_BYTE_7_0_LRCLK_SRC_IC_1_SHIFT  13

/* SERIAL_BYTE_7_1 (IC 1) */
#define R73_SERIAL_BYTE_7_1_FS_IC_1               0x2    /* 010b	[2:0] */
#define R73_SERIAL_BYTE_7_1_CLK_DOMAIN_IC_1       0x0    /* 00b	[4:3] */
#define R73_SERIAL_BYTE_7_1_TRISTATE_IC_1         0x0    /* 0b	[5] */
#define R73_SERIAL_BYTE_7_1_FS_IC_1_MASK          0x7
#define R73_SERIAL_BYTE_7_1_FS_IC_1_SHIFT         0
#define R73_SERIAL_BYTE_7_1_CLK_DOMAIN_IC_1_MASK  0x18
#define R73_SERIAL_BYTE_7_1_CLK_DOMAIN_IC_1_SHIFT 3
#define R73_SERIAL_BYTE_7_1_TRISTATE_IC_1_MASK    0x20
#define R73_SERIAL_BYTE_7_1_TRISTATE_IC_1_SHIFT   5

/* SDATA_0_ROUTE (IC 1) */
#define R74_SDATA_0_ROUTE_CHAN_IC_1               0x0    /* 00b	[1:0] */
#define R74_SDATA_0_ROUTE_PORT_SEL_IC_1           0x0    /* 00b	[3:2] */
#define R74_SDATA_0_ROUTE_DIR_IC_1                0x0    /* 0b	[4] */
#define R74_SDATA_0_ROUTE_ENBL_IC_1               0x0    /* 0b	[5] */
#define R74_SDATA_0_ROUTE_CHAN_IC_1_MASK          0x3
#define R74_SDATA_0_ROUTE_CHAN_IC_1_SHIFT         0
#define R74_SDATA_0_ROUTE_PORT_SEL_IC_1_MASK      0xC
#define R74_SDATA_0_ROUTE_PORT_SEL_IC_1_SHIFT     2
#define R74_SDATA_0_ROUTE_DIR_IC_1_MASK           0x10
#define R74_SDATA_0_ROUTE_DIR_IC_1_SHIFT          4
#define R74_SDATA_0_ROUTE_ENBL_IC_1_MASK          0x20
#define R74_SDATA_0_ROUTE_ENBL_IC_1_SHIFT         5

