LeanderGlanda/endstufe-esp32/src/sigmastudio/systemfiles_IC_1_REG.h
/* FTDM_IN2 (IC 1) */
#define R84_FTDM_IN2_BYTE_IN_POS_IC_1             0x0    /* 00b	[1:0] */
#define R84_FTDM_IN2_CHANNEL_IN_POS_IC_1          0x0    /* 000b	[4:2] */
#define R84_FTDM_IN2_SERIAL_IN_SEL_IC_1           0x0    /* 0b	[5] */
#define R84_FTDM_IN2_REVERSE_IN_BYTE_IC_1         0x0    /* 0b	[6] */
#define R84_FTDM_IN2_SLOT_ENABLE_IN_IC_1          0x0    /* 0b	[7] */
#define R84_FTDM_IN2_BYTE_IN_POS_IC_1_MASK        0x3
#define R84_FTDM_IN2_BYTE_IN_POS_IC_1_SHIFT       0
#define R84_FTDM_IN2_CHANNEL_IN_POS_IC_1_MASK     0x1C
#define R84_FTDM_IN2_CHANNEL_IN_POS_IC_1_SHIFT    2
#define R84_FTDM_IN2_SERIAL_IN_SEL_IC_1_MASK      0x20
#define R84_FTDM_IN2_SERIAL_IN_SEL_IC_1_SHIFT     5
#define R84_FTDM_IN2_REVERSE_IN_BYTE_IC_1_MASK    0x40
#define R84_FTDM_IN2_REVERSE_IN_BYTE_IC_1_SHIFT   6
#define R84_FTDM_IN2_SLOT_ENABLE_IN_IC_1_MASK     0x80
#define R84_FTDM_IN2_SLOT_ENABLE_IN_IC_1_SHIFT    7

/* FTDM_IN3 (IC 1) */
#define R85_FTDM_IN3_BYTE_IN_POS_IC_1             0x0    /* 00b	[1:0] */
#define R85_FTDM_IN3_CHANNEL_IN_POS_IC_1          0x0    /* 000b	[4:2] */
#define R85_FTDM_IN3_SERIAL_IN_SEL_IC_1           0x0    /* 0b	[5] */
#define R85_FTDM_IN3_REVERSE_IN_BYTE_IC_1         0x0    /* 0b	[6] */
#define R85_FTDM_IN3_SLOT_ENABLE_IN_IC_1          0x0    /* 0b	[7] */
#define R85_FTDM_IN3_BYTE_IN_POS_IC_1_MASK        0x3
#define R85_FTDM_IN3_BYTE_IN_POS_IC_1_SHIFT       0
#define R85_FTDM_IN3_CHANNEL_IN_POS_IC_1_MASK     0x1C
#define R85_FTDM_IN3_CHANNEL_IN_POS_IC_1_SHIFT    2
#define R85_FTDM_IN3_SERIAL_IN_SEL_IC_1_MASK      0x20
#define R85_FTDM_IN3_SERIAL_IN_SEL_IC_1_SHIFT     5
#define R85_FTDM_IN3_REVERSE_IN_BYTE_IC_1_MASK    0x40
#define R85_FTDM_IN3_REVERSE_IN_BYTE_IC_1_SHIFT   6
#define R85_FTDM_IN3_SLOT_ENABLE_IN_IC_1_MASK     0x80
#define R85_FTDM_IN3_SLOT_ENABLE_IN_IC_1_SHIFT    7

/* FTDM_IN4 (IC 1) */
#define R86_FTDM_IN4_BYTE_IN_POS_IC_1             0x0    /* 00b	[1:0] */
#define R86_FTDM_IN4_CHANNEL_IN_POS_IC_1          0x0    /* 000b	[4:2] */
#define R86_FTDM_IN4_SERIAL_IN_SEL_IC_1           0x0    /* 0b	[5] */
#define R86_FTDM_IN4_REVERSE_IN_BYTE_IC_1         0x0    /* 0b	[6] */
#define R86_FTDM_IN4_SLOT_ENABLE_IN_IC_1          0x0    /* 0b	[7] */
#define R86_FTDM_IN4_BYTE_IN_POS_IC_1_MASK        0x3
#define R86_FTDM_IN4_BYTE_IN_POS_IC_1_SHIFT       0
#define R86_FTDM_IN4_CHANNEL_IN_POS_IC_1_MASK     0x1C
#define R86_FTDM_IN4_CHANNEL_IN_POS_IC_1_SHIFT    2
#define R86_FTDM_IN4_SERIAL_IN_SEL_IC_1_MASK      0x20
#define R86_FTDM_IN4_SERIAL_IN_SEL_IC_1_SHIFT     5
#define R86_FTDM_IN4_REVERSE_IN_BYTE_IC_1_MASK    0x40
#define R86_FTDM_IN4_REVERSE_IN_BYTE_IC_1_SHIFT   6
#define R86_FTDM_IN4_SLOT_ENABLE_IN_IC_1_MASK     0x80
#define R86_FTDM_IN4_SLOT_ENABLE_IN_IC_1_SHIFT    7

/* FTDM_IN5 (IC 1) */
#define R87_FTDM_IN5_BYTE_IN_POS_IC_1             0x0    /* 00b	[1:0] */
#define R87_FTDM_IN5_CHANNEL_IN_POS_IC_1          0x0    /* 000b	[4:2] */
#define R87_FTDM_IN5_SERIAL_IN_SEL_IC_1           0x0    /* 0b	[5] */
#define R87_FTDM_IN5_REVERSE_IN_BYTE_IC_1         0x0    /* 0b	[6] */
#define R87_FTDM_IN5_SLOT_ENABLE_IN_IC_1          0x0    /* 0b	[7] */
#define R87_FTDM_IN5_BYTE_IN_POS_IC_1_MASK        0x3
#define R87_FTDM_IN5_BYTE_IN_POS_IC_1_SHIFT       0
#define R87_FTDM_IN5_CHANNEL_IN_POS_IC_1_MASK     0x1C
#define R87_FTDM_IN5_CHANNEL_IN_POS_IC_1_SHIFT    2
#define R87_FTDM_IN5_SERIAL_IN_SEL_IC_1_MASK      0x20
#define R87_FTDM_IN5_SERIAL_IN_SEL_IC_1_SHIFT     5
#define R87_FTDM_IN5_REVERSE_IN_BYTE_IC_1_MASK    0x40
#define R87_FTDM_IN5_REVERSE_IN_BYTE_IC_1_SHIFT   6
#define R87_FTDM_IN5_SLOT_ENABLE_IN_IC_1_MASK     0x80
#define R87_FTDM_IN5_SLOT_ENABLE_IN_IC_1_SHIFT    7

/* FTDM_IN6 (IC 1) */
#define R88_FTDM_IN6_BYTE_IN_POS_IC_1             0x0    /* 00b	[1:0] */
#define R88_FTDM_IN6_CHANNEL_IN_POS_IC_1          0x0    /* 000b	[4:2] */
#define R88_FTDM_IN6_SERIAL_IN_SEL_IC_1           0x0    /* 0b	[5] */
#define R88_FTDM_IN6_REVERSE_IN_BYTE_IC_1         0x0    /* 0b	[6] */
#define R88_FTDM_IN6_SLOT_ENABLE_IN_IC_1          0x0    /* 0b	[7] */
#define R88_FTDM_IN6_BYTE_IN_POS_IC_1_MASK        0x3
#define R88_FTDM_IN6_BYTE_IN_POS_IC_1_SHIFT       0
#define R88_FTDM_IN6_CHANNEL_IN_POS_IC_1_MASK     0x1C
#define R88_FTDM_IN6_CHANNEL_IN_POS_IC_1_SHIFT    2
#define R88_FTDM_IN6_SERIAL_IN_SEL_IC_1_MASK      0x20
#define R88_FTDM_IN6_SERIAL_IN_SEL_IC_1_SHIFT     5
#define R88_FTDM_IN6_REVERSE_IN_BYTE_IC_1_MASK    0x40
#define R88_FTDM_IN6_REVERSE_IN_BYTE_IC_1_SHIFT   6
#define R88_FTDM_IN6_SLOT_ENABLE_IN_IC_1_MASK     0x80
#define R88_FTDM_IN6_SLOT_ENABLE_IN_IC_1_SHIFT    7

/* FTDM_IN7 (IC 1) */
#define R89_FTDM_IN7_BYTE_IN_POS_IC_1             0x0    /* 00b	[1:0] */
#define R89_FTDM_IN7_CHANNEL_IN_POS_IC_1          0x0    /* 000b	[4:2] */
#define R89_FTDM_IN7_SERIAL_IN_SEL_IC_1           0x0    /* 0b	[5] */
#define R89_FTDM_IN7_REVERSE_IN_BYTE_IC_1         0x0    /* 0b	[6] */
#define R89_FTDM_IN7_SLOT_ENABLE_IN_IC_1          0x0    /* 0b	[7] */
#define R89_FTDM_IN7_BYTE_IN_POS_IC_1_MASK        0x3
#define R89_FTDM_IN7_BYTE_IN_POS_IC_1_SHIFT       0
#define R89_FTDM_IN7_CHANNEL_IN_POS_IC_1_MASK     0x1C
#define R89_FTDM_IN7_CHANNEL_IN_POS_IC_1_SHIFT    2
#define R89_FTDM_IN7_SERIAL_IN_SEL_IC_1_MASK      0x20
#define R89_FTDM_IN7_SERIAL_IN_SEL_IC_1_SHIFT     5
#define R89_FTDM_IN7_REVERSE_IN_BYTE_IC_1_MASK    0x40
#define R89_FTDM_IN7_REVERSE_IN_BYTE_IC_1_SHIFT   6
#define R89_FTDM_IN7_SLOT_ENABLE_IN_IC_1_MASK     0x80
#define R89_FTDM_IN7_SLOT_ENABLE_IN_IC_1_SHIFT    7

/* FTDM_IN8 (IC 1) */
#define R90_FTDM_IN8_BYTE_IN_POS_IC_1             0x0    /* 00b	[1:0] */
#define R90_FTDM_IN8_CHANNEL_IN_POS_IC_1          0x0    /* 000b	[4:2] */
#define R90_FTDM_IN8_SERIAL_IN_SEL_IC_1           0x0    /* 0b	[5] */
#define R90_FTDM_IN8_REVERSE_IN_BYTE_IC_1         0x0    /* 0b	[6] */
#define R90_FTDM_IN8_SLOT_ENABLE_IN_IC_1          0x0    /* 0b	[7] */
#define R90_FTDM_IN8_BYTE_IN_POS_IC_1_MASK        0x3
#define R90_FTDM_IN8_BYTE_IN_POS_IC_1_SHIFT       0
#define R90_FTDM_IN8_CHANNEL_IN_POS_IC_1_MASK     0x1C
#define R90_FTDM_IN8_CHANNEL_IN_POS_IC_1_SHIFT    2
#define R90_FTDM_IN8_SERIAL_IN_SEL_IC_1_MASK      0x20
#define R90_FTDM_IN8_SERIAL_IN_SEL_IC_1_SHIFT     5
#define R90_FTDM_IN8_REVERSE_IN_BYTE_IC_1_MASK    0x40
#define R90_FTDM_IN8_REVERSE_IN_BYTE_IC_1_SHIFT   6
#define R90_FTDM_IN8_SLOT_ENABLE_IN_IC_1_MASK     0x80
#define R90_FTDM_IN8_SLOT_ENABLE_IN_IC_1_SHIFT    7

