LeanderGlanda/endstufe-esp32/src/sigmastudio/systemfiles_IC_1_REG.h
/* FTDM_IN9 (IC 1) */
#define R91_FTDM_IN9_BYTE_IN_POS_IC_1             0x0    /* 00b	[1:0] */
#define R91_FTDM_IN9_CHANNEL_IN_POS_IC_1          0x0    /* 000b	[4:2] */
#define R91_FTDM_IN9_SERIAL_IN_SEL_IC_1           0x0    /* 0b	[5] */
#define R91_FTDM_IN9_REVERSE_IN_BYTE_IC_1         0x0    /* 0b	[6] */
#define R91_FTDM_IN9_SLOT_ENABLE_IN_IC_1          0x0    /* 0b	[7] */
#define R91_FTDM_IN9_BYTE_IN_POS_IC_1_MASK        0x3
#define R91_FTDM_IN9_BYTE_IN_POS_IC_1_SHIFT       0
#define R91_FTDM_IN9_CHANNEL_IN_POS_IC_1_MASK     0x1C
#define R91_FTDM_IN9_CHANNEL_IN_POS_IC_1_SHIFT    2
#define R91_FTDM_IN9_SERIAL_IN_SEL_IC_1_MASK      0x20
#define R91_FTDM_IN9_SERIAL_IN_SEL_IC_1_SHIFT     5
#define R91_FTDM_IN9_REVERSE_IN_BYTE_IC_1_MASK    0x40
#define R91_FTDM_IN9_REVERSE_IN_BYTE_IC_1_SHIFT   6
#define R91_FTDM_IN9_SLOT_ENABLE_IN_IC_1_MASK     0x80
#define R91_FTDM_IN9_SLOT_ENABLE_IN_IC_1_SHIFT    7

/* FTDM_IN10 (IC 1) */
#define R92_FTDM_IN10_BYTE_IN_POS_IC_1            0x0    /* 00b	[1:0] */
#define R92_FTDM_IN10_CHANNEL_IN_POS_IC_1         0x0    /* 000b	[4:2] */
#define R92_FTDM_IN10_SERIAL_IN_SEL_IC_1          0x0    /* 0b	[5] */
#define R92_FTDM_IN10_REVERSE_IN_BYTE_IC_1        0x0    /* 0b	[6] */
#define R92_FTDM_IN10_SLOT_ENABLE_IN_IC_1         0x0    /* 0b	[7] */
#define R92_FTDM_IN10_BYTE_IN_POS_IC_1_MASK       0x3
#define R92_FTDM_IN10_BYTE_IN_POS_IC_1_SHIFT      0
#define R92_FTDM_IN10_CHANNEL_IN_POS_IC_1_MASK    0x1C
#define R92_FTDM_IN10_CHANNEL_IN_POS_IC_1_SHIFT   2
#define R92_FTDM_IN10_SERIAL_IN_SEL_IC_1_MASK     0x20
#define R92_FTDM_IN10_SERIAL_IN_SEL_IC_1_SHIFT    5
#define R92_FTDM_IN10_REVERSE_IN_BYTE_IC_1_MASK   0x40
#define R92_FTDM_IN10_REVERSE_IN_BYTE_IC_1_SHIFT  6
#define R92_FTDM_IN10_SLOT_ENABLE_IN_IC_1_MASK    0x80
#define R92_FTDM_IN10_SLOT_ENABLE_IN_IC_1_SHIFT   7

/* FTDM_IN11 (IC 1) */
#define R93_FTDM_IN11_BYTE_IN_POS_IC_1            0x0    /* 00b	[1:0] */
#define R93_FTDM_IN11_CHANNEL_IN_POS_IC_1         0x0    /* 000b	[4:2] */
#define R93_FTDM_IN11_SERIAL_IN_SEL_IC_1          0x0    /* 0b	[5] */
#define R93_FTDM_IN11_REVERSE_IN_BYTE_IC_1        0x0    /* 0b	[6] */
#define R93_FTDM_IN11_SLOT_ENABLE_IN_IC_1         0x0    /* 0b	[7] */
#define R93_FTDM_IN11_BYTE_IN_POS_IC_1_MASK       0x3
#define R93_FTDM_IN11_BYTE_IN_POS_IC_1_SHIFT      0
#define R93_FTDM_IN11_CHANNEL_IN_POS_IC_1_MASK    0x1C
#define R93_FTDM_IN11_CHANNEL_IN_POS_IC_1_SHIFT   2
#define R93_FTDM_IN11_SERIAL_IN_SEL_IC_1_MASK     0x20
#define R93_FTDM_IN11_SERIAL_IN_SEL_IC_1_SHIFT    5
#define R93_FTDM_IN11_REVERSE_IN_BYTE_IC_1_MASK   0x40
#define R93_FTDM_IN11_REVERSE_IN_BYTE_IC_1_SHIFT  6
#define R93_FTDM_IN11_SLOT_ENABLE_IN_IC_1_MASK    0x80
#define R93_FTDM_IN11_SLOT_ENABLE_IN_IC_1_SHIFT   7

/* FTDM_IN12 (IC 1) */
#define R94_FTDM_IN12_BYTE_IN_POS_IC_1            0x0    /* 00b	[1:0] */
#define R94_FTDM_IN12_CHANNEL_IN_POS_IC_1         0x0    /* 000b	[4:2] */
#define R94_FTDM_IN12_SERIAL_IN_SEL_IC_1          0x0    /* 0b	[5] */
#define R94_FTDM_IN12_REVERSE_IN_BYTE_IC_1        0x0    /* 0b	[6] */
#define R94_FTDM_IN12_SLOT_ENABLE_IN_IC_1         0x0    /* 0b	[7] */
#define R94_FTDM_IN12_BYTE_IN_POS_IC_1_MASK       0x3
#define R94_FTDM_IN12_BYTE_IN_POS_IC_1_SHIFT      0
#define R94_FTDM_IN12_CHANNEL_IN_POS_IC_1_MASK    0x1C
#define R94_FTDM_IN12_CHANNEL_IN_POS_IC_1_SHIFT   2
#define R94_FTDM_IN12_SERIAL_IN_SEL_IC_1_MASK     0x20
#define R94_FTDM_IN12_SERIAL_IN_SEL_IC_1_SHIFT    5
#define R94_FTDM_IN12_REVERSE_IN_BYTE_IC_1_MASK   0x40
#define R94_FTDM_IN12_REVERSE_IN_BYTE_IC_1_SHIFT  6
#define R94_FTDM_IN12_SLOT_ENABLE_IN_IC_1_MASK    0x80
#define R94_FTDM_IN12_SLOT_ENABLE_IN_IC_1_SHIFT   7

/* FTDM_IN13 (IC 1) */
#define R95_FTDM_IN13_BYTE_IN_POS_IC_1            0x0    /* 00b	[1:0] */
#define R95_FTDM_IN13_CHANNEL_IN_POS_IC_1         0x0    /* 000b	[4:2] */
#define R95_FTDM_IN13_SERIAL_IN_SEL_IC_1          0x0    /* 0b	[5] */
#define R95_FTDM_IN13_REVERSE_IN_BYTE_IC_1        0x0    /* 0b	[6] */
#define R95_FTDM_IN13_SLOT_ENABLE_IN_IC_1         0x0    /* 0b	[7] */
#define R95_FTDM_IN13_BYTE_IN_POS_IC_1_MASK       0x3
#define R95_FTDM_IN13_BYTE_IN_POS_IC_1_SHIFT      0
#define R95_FTDM_IN13_CHANNEL_IN_POS_IC_1_MASK    0x1C
#define R95_FTDM_IN13_CHANNEL_IN_POS_IC_1_SHIFT   2
#define R95_FTDM_IN13_SERIAL_IN_SEL_IC_1_MASK     0x20
#define R95_FTDM_IN13_SERIAL_IN_SEL_IC_1_SHIFT    5
#define R95_FTDM_IN13_REVERSE_IN_BYTE_IC_1_MASK   0x40
#define R95_FTDM_IN13_REVERSE_IN_BYTE_IC_1_SHIFT  6
#define R95_FTDM_IN13_SLOT_ENABLE_IN_IC_1_MASK    0x80
#define R95_FTDM_IN13_SLOT_ENABLE_IN_IC_1_SHIFT   7

/* FTDM_IN14 (IC 1) */
#define R96_FTDM_IN14_BYTE_IN_POS_IC_1            0x0    /* 00b	[1:0] */
#define R96_FTDM_IN14_CHANNEL_IN_POS_IC_1         0x0    /* 000b	[4:2] */
#define R96_FTDM_IN14_SERIAL_IN_SEL_IC_1          0x0    /* 0b	[5] */
#define R96_FTDM_IN14_REVERSE_IN_BYTE_IC_1        0x0    /* 0b	[6] */
#define R96_FTDM_IN14_SLOT_ENABLE_IN_IC_1         0x0    /* 0b	[7] */
#define R96_FTDM_IN14_BYTE_IN_POS_IC_1_MASK       0x3
#define R96_FTDM_IN14_BYTE_IN_POS_IC_1_SHIFT      0
#define R96_FTDM_IN14_CHANNEL_IN_POS_IC_1_MASK    0x1C
#define R96_FTDM_IN14_CHANNEL_IN_POS_IC_1_SHIFT   2
#define R96_FTDM_IN14_SERIAL_IN_SEL_IC_1_MASK     0x20
#define R96_FTDM_IN14_SERIAL_IN_SEL_IC_1_SHIFT    5
#define R96_FTDM_IN14_REVERSE_IN_BYTE_IC_1_MASK   0x40
#define R96_FTDM_IN14_REVERSE_IN_BYTE_IC_1_SHIFT  6
#define R96_FTDM_IN14_SLOT_ENABLE_IN_IC_1_MASK    0x80
#define R96_FTDM_IN14_SLOT_ENABLE_IN_IC_1_SHIFT   7

/* FTDM_IN15 (IC 1) */
#define R97_FTDM_IN15_BYTE_IN_POS_IC_1            0x0    /* 00b	[1:0] */
#define R97_FTDM_IN15_CHANNEL_IN_POS_IC_1         0x0    /* 000b	[4:2] */
#define R97_FTDM_IN15_SERIAL_IN_SEL_IC_1          0x0    /* 0b	[5] */
#define R97_FTDM_IN15_REVERSE_IN_BYTE_IC_1        0x0    /* 0b	[6] */
#define R97_FTDM_IN15_SLOT_ENABLE_IN_IC_1         0x0    /* 0b	[7] */
#define R97_FTDM_IN15_BYTE_IN_POS_IC_1_MASK       0x3
#define R97_FTDM_IN15_BYTE_IN_POS_IC_1_SHIFT      0
#define R97_FTDM_IN15_CHANNEL_IN_POS_IC_1_MASK    0x1C
#define R97_FTDM_IN15_CHANNEL_IN_POS_IC_1_SHIFT   2
#define R97_FTDM_IN15_SERIAL_IN_SEL_IC_1_MASK     0x20
#define R97_FTDM_IN15_SERIAL_IN_SEL_IC_1_SHIFT    5
#define R97_FTDM_IN15_REVERSE_IN_BYTE_IC_1_MASK   0x40
#define R97_FTDM_IN15_REVERSE_IN_BYTE_IC_1_SHIFT  6
#define R97_FTDM_IN15_SLOT_ENABLE_IN_IC_1_MASK    0x80
#define R97_FTDM_IN15_SLOT_ENABLE_IN_IC_1_SHIFT   7

/* FTDM_IN16 (IC 1) */
#define R98_FTDM_IN16_BYTE_IN_POS_IC_1            0x0    /* 00b	[1:0] */
#define R98_FTDM_IN16_CHANNEL_IN_POS_IC_1         0x0    /* 000b	[4:2] */
#define R98_FTDM_IN16_SERIAL_IN_SEL_IC_1          0x0    /* 0b	[5] */
#define R98_FTDM_IN16_REVERSE_IN_BYTE_IC_1        0x0    /* 0b	[6] */
#define R98_FTDM_IN16_SLOT_ENABLE_IN_IC_1         0x0    /* 0b	[7] */
#define R98_FTDM_IN16_BYTE_IN_POS_IC_1_MASK       0x3
#define R98_FTDM_IN16_BYTE_IN_POS_IC_1_SHIFT      0
#define R98_FTDM_IN16_CHANNEL_IN_POS_IC_1_MASK    0x1C
#define R98_FTDM_IN16_CHANNEL_IN_POS_IC_1_SHIFT   2
#define R98_FTDM_IN16_SERIAL_IN_SEL_IC_1_MASK     0x20
#define R98_FTDM_IN16_SERIAL_IN_SEL_IC_1_SHIFT    5
#define R98_FTDM_IN16_REVERSE_IN_BYTE_IC_1_MASK   0x40
#define R98_FTDM_IN16_REVERSE_IN_BYTE_IC_1_SHIFT  6
#define R98_FTDM_IN16_SLOT_ENABLE_IN_IC_1_MASK    0x80
#define R98_FTDM_IN16_SLOT_ENABLE_IN_IC_1_SHIFT   7

/* FTDM_IN17 (IC 1) */
#define R99_FTDM_IN17_BYTE_IN_POS_IC_1            0x0    /* 00b	[1:0] */
#define R99_FTDM_IN17_CHANNEL_IN_POS_IC_1         0x0    /* 000b	[4:2] */
#define R99_FTDM_IN17_SERIAL_IN_SEL_IC_1          0x0    /* 0b	[5] */
#define R99_FTDM_IN17_REVERSE_IN_BYTE_IC_1        0x0    /* 0b	[6] */
#define R99_FTDM_IN17_SLOT_ENABLE_IN_IC_1         0x0    /* 0b	[7] */
#define R99_FTDM_IN17_BYTE_IN_POS_IC_1_MASK       0x3
#define R99_FTDM_IN17_BYTE_IN_POS_IC_1_SHIFT      0
#define R99_FTDM_IN17_CHANNEL_IN_POS_IC_1_MASK    0x1C
#define R99_FTDM_IN17_CHANNEL_IN_POS_IC_1_SHIFT   2
#define R99_FTDM_IN17_SERIAL_IN_SEL_IC_1_MASK     0x20
#define R99_FTDM_IN17_SERIAL_IN_SEL_IC_1_SHIFT    5
#define R99_FTDM_IN17_REVERSE_IN_BYTE_IC_1_MASK   0x40
#define R99_FTDM_IN17_REVERSE_IN_BYTE_IC_1_SHIFT  6
#define R99_FTDM_IN17_SLOT_ENABLE_IN_IC_1_MASK    0x80
#define R99_FTDM_IN17_SLOT_ENABLE_IN_IC_1_SHIFT   7

/* FTDM_IN18 (IC 1) */
#define R100_FTDM_IN18_BYTE_IN_POS_IC_1           0x0    /* 00b	[1:0] */
#define R100_FTDM_IN18_CHANNEL_IN_POS_IC_1        0x0    /* 000b	[4:2] */
#define R100_FTDM_IN18_SERIAL_IN_SEL_IC_1         0x0    /* 0b	[5] */
#define R100_FTDM_IN18_REVERSE_IN_BYTE_IC_1       0x0    /* 0b	[6] */
#define R100_FTDM_IN18_SLOT_ENABLE_IN_IC_1        0x0    /* 0b	[7] */
#define R100_FTDM_IN18_BYTE_IN_POS_IC_1_MASK      0x3
#define R100_FTDM_IN18_BYTE_IN_POS_IC_1_SHIFT     0
#define R100_FTDM_IN18_CHANNEL_IN_POS_IC_1_MASK   0x1C
#define R100_FTDM_IN18_CHANNEL_IN_POS_IC_1_SHIFT  2
#define R100_FTDM_IN18_SERIAL_IN_SEL_IC_1_MASK    0x20
#define R100_FTDM_IN18_SERIAL_IN_SEL_IC_1_SHIFT   5
#define R100_FTDM_IN18_REVERSE_IN_BYTE_IC_1_MASK  0x40
#define R100_FTDM_IN18_REVERSE_IN_BYTE_IC_1_SHIFT 6
#define R100_FTDM_IN18_SLOT_ENABLE_IN_IC_1_MASK   0x80
#define R100_FTDM_IN18_SLOT_ENABLE_IN_IC_1_SHIFT  7

/* FTDM_IN19 (IC 1) */
#define R101_FTDM_IN19_BYTE_IN_POS_IC_1           0x0    /* 00b	[1:0] */
#define R101_FTDM_IN19_CHANNEL_IN_POS_IC_1        0x0    /* 000b	[4:2] */
#define R101_FTDM_IN19_SERIAL_IN_SEL_IC_1         0x0    /* 0b	[5] */
#define R101_FTDM_IN19_REVERSE_IN_BYTE_IC_1       0x0    /* 0b	[6] */
#define R101_FTDM_IN19_SLOT_ENABLE_IN_IC_1        0x0    /* 0b	[7] */
#define R101_FTDM_IN19_BYTE_IN_POS_IC_1_MASK      0x3
#define R101_FTDM_IN19_BYTE_IN_POS_IC_1_SHIFT     0
#define R101_FTDM_IN19_CHANNEL_IN_POS_IC_1_MASK   0x1C
#define R101_FTDM_IN19_CHANNEL_IN_POS_IC_1_SHIFT  2
#define R101_FTDM_IN19_SERIAL_IN_SEL_IC_1_MASK    0x20
#define R101_FTDM_IN19_SERIAL_IN_SEL_IC_1_SHIFT   5
#define R101_FTDM_IN19_REVERSE_IN_BYTE_IC_1_MASK  0x40
#define R101_FTDM_IN19_REVERSE_IN_BYTE_IC_1_SHIFT 6
#define R101_FTDM_IN19_SLOT_ENABLE_IN_IC_1_MASK   0x80
#define R101_FTDM_IN19_SLOT_ENABLE_IN_IC_1_SHIFT  7

