LeanderGlanda/endstufe-esp32/src/sigmastudio/systemfiles_IC_1_REG.h
/* FTDM_IN36 (IC 1) */
#define R118_FTDM_IN36_BYTE_IN_POS_IC_1           0x0    /* 00b	[1:0] */
#define R118_FTDM_IN36_CHANNEL_IN_POS_IC_1        0x0    /* 000b	[4:2] */
#define R118_FTDM_IN36_SERIAL_IN_SEL_IC_1         0x0    /* 0b	[5] */
#define R118_FTDM_IN36_REVERSE_IN_BYTE_IC_1       0x0    /* 0b	[6] */
#define R118_FTDM_IN36_SLOT_ENABLE_IN_IC_1        0x0    /* 0b	[7] */
#define R118_FTDM_IN36_BYTE_IN_POS_IC_1_MASK      0x3
#define R118_FTDM_IN36_BYTE_IN_POS_IC_1_SHIFT     0
#define R118_FTDM_IN36_CHANNEL_IN_POS_IC_1_MASK   0x1C
#define R118_FTDM_IN36_CHANNEL_IN_POS_IC_1_SHIFT  2
#define R118_FTDM_IN36_SERIAL_IN_SEL_IC_1_MASK    0x20
#define R118_FTDM_IN36_SERIAL_IN_SEL_IC_1_SHIFT   5
#define R118_FTDM_IN36_REVERSE_IN_BYTE_IC_1_MASK  0x40
#define R118_FTDM_IN36_REVERSE_IN_BYTE_IC_1_SHIFT 6
#define R118_FTDM_IN36_SLOT_ENABLE_IN_IC_1_MASK   0x80
#define R118_FTDM_IN36_SLOT_ENABLE_IN_IC_1_SHIFT  7

/* FTDM_IN37 (IC 1) */
#define R119_FTDM_IN37_BYTE_IN_POS_IC_1           0x0    /* 00b	[1:0] */
#define R119_FTDM_IN37_CHANNEL_IN_POS_IC_1        0x0    /* 000b	[4:2] */
#define R119_FTDM_IN37_SERIAL_IN_SEL_IC_1         0x0    /* 0b	[5] */
#define R119_FTDM_IN37_REVERSE_IN_BYTE_IC_1       0x0    /* 0b	[6] */
#define R119_FTDM_IN37_SLOT_ENABLE_IN_IC_1        0x0    /* 0b	[7] */
#define R119_FTDM_IN37_BYTE_IN_POS_IC_1_MASK      0x3
#define R119_FTDM_IN37_BYTE_IN_POS_IC_1_SHIFT     0
#define R119_FTDM_IN37_CHANNEL_IN_POS_IC_1_MASK   0x1C
#define R119_FTDM_IN37_CHANNEL_IN_POS_IC_1_SHIFT  2
#define R119_FTDM_IN37_SERIAL_IN_SEL_IC_1_MASK    0x20
#define R119_FTDM_IN37_SERIAL_IN_SEL_IC_1_SHIFT   5
#define R119_FTDM_IN37_REVERSE_IN_BYTE_IC_1_MASK  0x40
#define R119_FTDM_IN37_REVERSE_IN_BYTE_IC_1_SHIFT 6
#define R119_FTDM_IN37_SLOT_ENABLE_IN_IC_1_MASK   0x80
#define R119_FTDM_IN37_SLOT_ENABLE_IN_IC_1_SHIFT  7

/* FTDM_IN38 (IC 1) */
#define R120_FTDM_IN38_BYTE_IN_POS_IC_1           0x0    /* 00b	[1:0] */
#define R120_FTDM_IN38_CHANNEL_IN_POS_IC_1        0x0    /* 000b	[4:2] */
#define R120_FTDM_IN38_SERIAL_IN_SEL_IC_1         0x0    /* 0b	[5] */
#define R120_FTDM_IN38_REVERSE_IN_BYTE_IC_1       0x0    /* 0b	[6] */
#define R120_FTDM_IN38_SLOT_ENABLE_IN_IC_1        0x0    /* 0b	[7] */
#define R120_FTDM_IN38_BYTE_IN_POS_IC_1_MASK      0x3
#define R120_FTDM_IN38_BYTE_IN_POS_IC_1_SHIFT     0
#define R120_FTDM_IN38_CHANNEL_IN_POS_IC_1_MASK   0x1C
#define R120_FTDM_IN38_CHANNEL_IN_POS_IC_1_SHIFT  2
#define R120_FTDM_IN38_SERIAL_IN_SEL_IC_1_MASK    0x20
#define R120_FTDM_IN38_SERIAL_IN_SEL_IC_1_SHIFT   5
#define R120_FTDM_IN38_REVERSE_IN_BYTE_IC_1_MASK  0x40
#define R120_FTDM_IN38_REVERSE_IN_BYTE_IC_1_SHIFT 6
#define R120_FTDM_IN38_SLOT_ENABLE_IN_IC_1_MASK   0x80
#define R120_FTDM_IN38_SLOT_ENABLE_IN_IC_1_SHIFT  7

/* FTDM_IN39 (IC 1) */
#define R121_FTDM_IN39_BYTE_IN_POS_IC_1           0x0    /* 00b	[1:0] */
#define R121_FTDM_IN39_CHANNEL_IN_POS_IC_1        0x0    /* 000b	[4:2] */
#define R121_FTDM_IN39_SERIAL_IN_SEL_IC_1         0x0    /* 0b	[5] */
#define R121_FTDM_IN39_REVERSE_IN_BYTE_IC_1       0x0    /* 0b	[6] */
#define R121_FTDM_IN39_SLOT_ENABLE_IN_IC_1        0x0    /* 0b	[7] */
#define R121_FTDM_IN39_BYTE_IN_POS_IC_1_MASK      0x3
#define R121_FTDM_IN39_BYTE_IN_POS_IC_1_SHIFT     0
#define R121_FTDM_IN39_CHANNEL_IN_POS_IC_1_MASK   0x1C
#define R121_FTDM_IN39_CHANNEL_IN_POS_IC_1_SHIFT  2
#define R121_FTDM_IN39_SERIAL_IN_SEL_IC_1_MASK    0x20
#define R121_FTDM_IN39_SERIAL_IN_SEL_IC_1_SHIFT   5
#define R121_FTDM_IN39_REVERSE_IN_BYTE_IC_1_MASK  0x40
#define R121_FTDM_IN39_REVERSE_IN_BYTE_IC_1_SHIFT 6
#define R121_FTDM_IN39_SLOT_ENABLE_IN_IC_1_MASK   0x80
#define R121_FTDM_IN39_SLOT_ENABLE_IN_IC_1_SHIFT  7

/* FTDM_IN40 (IC 1) */
#define R122_FTDM_IN40_BYTE_IN_POS_IC_1           0x0    /* 00b	[1:0] */
#define R122_FTDM_IN40_CHANNEL_IN_POS_IC_1        0x0    /* 000b	[4:2] */
#define R122_FTDM_IN40_SERIAL_IN_SEL_IC_1         0x0    /* 0b	[5] */
#define R122_FTDM_IN40_REVERSE_IN_BYTE_IC_1       0x0    /* 0b	[6] */
#define R122_FTDM_IN40_SLOT_ENABLE_IN_IC_1        0x0    /* 0b	[7] */
#define R122_FTDM_IN40_BYTE_IN_POS_IC_1_MASK      0x3
#define R122_FTDM_IN40_BYTE_IN_POS_IC_1_SHIFT     0
#define R122_FTDM_IN40_CHANNEL_IN_POS_IC_1_MASK   0x1C
#define R122_FTDM_IN40_CHANNEL_IN_POS_IC_1_SHIFT  2
#define R122_FTDM_IN40_SERIAL_IN_SEL_IC_1_MASK    0x20
#define R122_FTDM_IN40_SERIAL_IN_SEL_IC_1_SHIFT   5
#define R122_FTDM_IN40_REVERSE_IN_BYTE_IC_1_MASK  0x40
#define R122_FTDM_IN40_REVERSE_IN_BYTE_IC_1_SHIFT 6
#define R122_FTDM_IN40_SLOT_ENABLE_IN_IC_1_MASK   0x80
#define R122_FTDM_IN40_SLOT_ENABLE_IN_IC_1_SHIFT  7

/* FTDM_IN41 (IC 1) */
#define R123_FTDM_IN41_BYTE_IN_POS_IC_1           0x0    /* 00b	[1:0] */
#define R123_FTDM_IN41_CHANNEL_IN_POS_IC_1        0x0    /* 000b	[4:2] */
#define R123_FTDM_IN41_SERIAL_IN_SEL_IC_1         0x0    /* 0b	[5] */
#define R123_FTDM_IN41_REVERSE_IN_BYTE_IC_1       0x0    /* 0b	[6] */
#define R123_FTDM_IN41_SLOT_ENABLE_IN_IC_1        0x0    /* 0b	[7] */
#define R123_FTDM_IN41_BYTE_IN_POS_IC_1_MASK      0x3
#define R123_FTDM_IN41_BYTE_IN_POS_IC_1_SHIFT     0
#define R123_FTDM_IN41_CHANNEL_IN_POS_IC_1_MASK   0x1C
#define R123_FTDM_IN41_CHANNEL_IN_POS_IC_1_SHIFT  2
#define R123_FTDM_IN41_SERIAL_IN_SEL_IC_1_MASK    0x20
#define R123_FTDM_IN41_SERIAL_IN_SEL_IC_1_SHIFT   5
#define R123_FTDM_IN41_REVERSE_IN_BYTE_IC_1_MASK  0x40
#define R123_FTDM_IN41_REVERSE_IN_BYTE_IC_1_SHIFT 6
#define R123_FTDM_IN41_SLOT_ENABLE_IN_IC_1_MASK   0x80
#define R123_FTDM_IN41_SLOT_ENABLE_IN_IC_1_SHIFT  7

/* FTDM_IN42 (IC 1) */
#define R124_FTDM_IN42_BYTE_IN_POS_IC_1           0x0    /* 00b	[1:0] */
#define R124_FTDM_IN42_CHANNEL_IN_POS_IC_1        0x0    /* 000b	[4:2] */
#define R124_FTDM_IN42_SERIAL_IN_SEL_IC_1         0x0    /* 0b	[5] */
#define R124_FTDM_IN42_REVERSE_IN_BYTE_IC_1       0x0    /* 0b	[6] */
#define R124_FTDM_IN42_SLOT_ENABLE_IN_IC_1        0x0    /* 0b	[7] */
#define R124_FTDM_IN42_BYTE_IN_POS_IC_1_MASK      0x3
#define R124_FTDM_IN42_BYTE_IN_POS_IC_1_SHIFT     0
#define R124_FTDM_IN42_CHANNEL_IN_POS_IC_1_MASK   0x1C
#define R124_FTDM_IN42_CHANNEL_IN_POS_IC_1_SHIFT  2
#define R124_FTDM_IN42_SERIAL_IN_SEL_IC_1_MASK    0x20
#define R124_FTDM_IN42_SERIAL_IN_SEL_IC_1_SHIFT   5
#define R124_FTDM_IN42_REVERSE_IN_BYTE_IC_1_MASK  0x40
#define R124_FTDM_IN42_REVERSE_IN_BYTE_IC_1_SHIFT 6
#define R124_FTDM_IN42_SLOT_ENABLE_IN_IC_1_MASK   0x80
#define R124_FTDM_IN42_SLOT_ENABLE_IN_IC_1_SHIFT  7

/* FTDM_IN43 (IC 1) */
#define R125_FTDM_IN43_BYTE_IN_POS_IC_1           0x0    /* 00b	[1:0] */
#define R125_FTDM_IN43_CHANNEL_IN_POS_IC_1        0x0    /* 000b	[4:2] */
#define R125_FTDM_IN43_SERIAL_IN_SEL_IC_1         0x0    /* 0b	[5] */
#define R125_FTDM_IN43_REVERSE_IN_BYTE_IC_1       0x0    /* 0b	[6] */
#define R125_FTDM_IN43_SLOT_ENABLE_IN_IC_1        0x0    /* 0b	[7] */
#define R125_FTDM_IN43_BYTE_IN_POS_IC_1_MASK      0x3
#define R125_FTDM_IN43_BYTE_IN_POS_IC_1_SHIFT     0
#define R125_FTDM_IN43_CHANNEL_IN_POS_IC_1_MASK   0x1C
#define R125_FTDM_IN43_CHANNEL_IN_POS_IC_1_SHIFT  2
#define R125_FTDM_IN43_SERIAL_IN_SEL_IC_1_MASK    0x20
#define R125_FTDM_IN43_SERIAL_IN_SEL_IC_1_SHIFT   5
#define R125_FTDM_IN43_REVERSE_IN_BYTE_IC_1_MASK  0x40
#define R125_FTDM_IN43_REVERSE_IN_BYTE_IC_1_SHIFT 6
#define R125_FTDM_IN43_SLOT_ENABLE_IN_IC_1_MASK   0x80
#define R125_FTDM_IN43_SLOT_ENABLE_IN_IC_1_SHIFT  7

/* FTDM_IN44 (IC 1) */
#define R126_FTDM_IN44_BYTE_IN_POS_IC_1           0x0    /* 00b	[1:0] */
#define R126_FTDM_IN44_CHANNEL_IN_POS_IC_1        0x0    /* 000b	[4:2] */
#define R126_FTDM_IN44_SERIAL_IN_SEL_IC_1         0x0    /* 0b	[5] */
#define R126_FTDM_IN44_REVERSE_IN_BYTE_IC_1       0x0    /* 0b	[6] */
#define R126_FTDM_IN44_SLOT_ENABLE_IN_IC_1        0x0    /* 0b	[7] */
#define R126_FTDM_IN44_BYTE_IN_POS_IC_1_MASK      0x3
#define R126_FTDM_IN44_BYTE_IN_POS_IC_1_SHIFT     0
#define R126_FTDM_IN44_CHANNEL_IN_POS_IC_1_MASK   0x1C
#define R126_FTDM_IN44_CHANNEL_IN_POS_IC_1_SHIFT  2
#define R126_FTDM_IN44_SERIAL_IN_SEL_IC_1_MASK    0x20
#define R126_FTDM_IN44_SERIAL_IN_SEL_IC_1_SHIFT   5
#define R126_FTDM_IN44_REVERSE_IN_BYTE_IC_1_MASK  0x40
#define R126_FTDM_IN44_REVERSE_IN_BYTE_IC_1_SHIFT 6
#define R126_FTDM_IN44_SLOT_ENABLE_IN_IC_1_MASK   0x80
#define R126_FTDM_IN44_SLOT_ENABLE_IN_IC_1_SHIFT  7

/* FTDM_IN45 (IC 1) */
#define R127_FTDM_IN45_BYTE_IN_POS_IC_1           0x0    /* 00b	[1:0] */
#define R127_FTDM_IN45_CHANNEL_IN_POS_IC_1        0x0    /* 000b	[4:2] */
#define R127_FTDM_IN45_SERIAL_IN_SEL_IC_1         0x0    /* 0b	[5] */
#define R127_FTDM_IN45_REVERSE_IN_BYTE_IC_1       0x0    /* 0b	[6] */
#define R127_FTDM_IN45_SLOT_ENABLE_IN_IC_1        0x0    /* 0b	[7] */
#define R127_FTDM_IN45_BYTE_IN_POS_IC_1_MASK      0x3
#define R127_FTDM_IN45_BYTE_IN_POS_IC_1_SHIFT     0
#define R127_FTDM_IN45_CHANNEL_IN_POS_IC_1_MASK   0x1C
#define R127_FTDM_IN45_CHANNEL_IN_POS_IC_1_SHIFT  2
#define R127_FTDM_IN45_SERIAL_IN_SEL_IC_1_MASK    0x20
#define R127_FTDM_IN45_SERIAL_IN_SEL_IC_1_SHIFT   5
#define R127_FTDM_IN45_REVERSE_IN_BYTE_IC_1_MASK  0x40
#define R127_FTDM_IN45_REVERSE_IN_BYTE_IC_1_SHIFT 6
#define R127_FTDM_IN45_SLOT_ENABLE_IN_IC_1_MASK   0x80
#define R127_FTDM_IN45_SLOT_ENABLE_IN_IC_1_SHIFT  7

/* FTDM_IN46 (IC 1) */
#define R128_FTDM_IN46_BYTE_IN_POS_IC_1           0x0    /* 00b	[1:0] */
#define R128_FTDM_IN46_CHANNEL_IN_POS_IC_1        0x0    /* 000b	[4:2] */
#define R128_FTDM_IN46_SERIAL_IN_SEL_IC_1         0x0    /* 0b	[5] */
#define R128_FTDM_IN46_REVERSE_IN_BYTE_IC_1       0x0    /* 0b	[6] */
#define R128_FTDM_IN46_SLOT_ENABLE_IN_IC_1        0x0    /* 0b	[7] */
#define R128_FTDM_IN46_BYTE_IN_POS_IC_1_MASK      0x3
#define R128_FTDM_IN46_BYTE_IN_POS_IC_1_SHIFT     0
#define R128_FTDM_IN46_CHANNEL_IN_POS_IC_1_MASK   0x1C
#define R128_FTDM_IN46_CHANNEL_IN_POS_IC_1_SHIFT  2
#define R128_FTDM_IN46_SERIAL_IN_SEL_IC_1_MASK    0x20
#define R128_FTDM_IN46_SERIAL_IN_SEL_IC_1_SHIFT   5
#define R128_FTDM_IN46_REVERSE_IN_BYTE_IC_1_MASK  0x40
#define R128_FTDM_IN46_REVERSE_IN_BYTE_IC_1_SHIFT 6
#define R128_FTDM_IN46_SLOT_ENABLE_IN_IC_1_MASK   0x80
#define R128_FTDM_IN46_SLOT_ENABLE_IN_IC_1_SHIFT  7

/* FTDM_IN47 (IC 1) */
#define R129_FTDM_IN47_BYTE_IN_POS_IC_1           0x0    /* 00b	[1:0] */
#define R129_FTDM_IN47_CHANNEL_IN_POS_IC_1        0x0    /* 000b	[4:2] */
#define R129_FTDM_IN47_SERIAL_IN_SEL_IC_1         0x0    /* 0b	[5] */
#define R129_FTDM_IN47_REVERSE_IN_BYTE_IC_1       0x0    /* 0b	[6] */
#define R129_FTDM_IN47_SLOT_ENABLE_IN_IC_1        0x0    /* 0b	[7] */
#define R129_FTDM_IN47_BYTE_IN_POS_IC_1_MASK      0x3
#define R129_FTDM_IN47_BYTE_IN_POS_IC_1_SHIFT     0
#define R129_FTDM_IN47_CHANNEL_IN_POS_IC_1_MASK   0x1C
#define R129_FTDM_IN47_CHANNEL_IN_POS_IC_1_SHIFT  2
#define R129_FTDM_IN47_SERIAL_IN_SEL_IC_1_MASK    0x20
#define R129_FTDM_IN47_SERIAL_IN_SEL_IC_1_SHIFT   5
#define R129_FTDM_IN47_REVERSE_IN_BYTE_IC_1_MASK  0x40
#define R129_FTDM_IN47_REVERSE_IN_BYTE_IC_1_SHIFT 6
#define R129_FTDM_IN47_SLOT_ENABLE_IN_IC_1_MASK   0x80
#define R129_FTDM_IN47_SLOT_ENABLE_IN_IC_1_SHIFT  7

/* FTDM_IN48 (IC 1) */
#define R130_FTDM_IN48_BYTE_IN_POS_IC_1           0x0    /* 00b	[1:0] */
#define R130_FTDM_IN48_CHANNEL_IN_POS_IC_1        0x0    /* 000b	[4:2] */
#define R130_FTDM_IN48_SERIAL_IN_SEL_IC_1         0x0    /* 0b	[5] */
#define R130_FTDM_IN48_REVERSE_IN_BYTE_IC_1       0x0    /* 0b	[6] */
#define R130_FTDM_IN48_SLOT_ENABLE_IN_IC_1        0x0    /* 0b	[7] */
#define R130_FTDM_IN48_BYTE_IN_POS_IC_1_MASK      0x3
#define R130_FTDM_IN48_BYTE_IN_POS_IC_1_SHIFT     0
#define R130_FTDM_IN48_CHANNEL_IN_POS_IC_1_MASK   0x1C
#define R130_FTDM_IN48_CHANNEL_IN_POS_IC_1_SHIFT  2
#define R130_FTDM_IN48_SERIAL_IN_SEL_IC_1_MASK    0x20
#define R130_FTDM_IN48_SERIAL_IN_SEL_IC_1_SHIFT   5
#define R130_FTDM_IN48_REVERSE_IN_BYTE_IC_1_MASK  0x40
#define R130_FTDM_IN48_REVERSE_IN_BYTE_IC_1_SHIFT 6
#define R130_FTDM_IN48_SLOT_ENABLE_IN_IC_1_MASK   0x80
#define R130_FTDM_IN48_SLOT_ENABLE_IN_IC_1_SHIFT  7

/* FTDM_IN49 (IC 1) */
#define R131_FTDM_IN49_BYTE_IN_POS_IC_1           0x0    /* 00b	[1:0] */
#define R131_FTDM_IN49_CHANNEL_IN_POS_IC_1        0x0    /* 000b	[4:2] */
#define R131_FTDM_IN49_SERIAL_IN_SEL_IC_1         0x0    /* 0b	[5] */
#define R131_FTDM_IN49_REVERSE_IN_BYTE_IC_1       0x0    /* 0b	[6] */
#define R131_FTDM_IN49_SLOT_ENABLE_IN_IC_1        0x0    /* 0b	[7] */
#define R131_FTDM_IN49_BYTE_IN_POS_IC_1_MASK      0x3
#define R131_FTDM_IN49_BYTE_IN_POS_IC_1_SHIFT     0
#define R131_FTDM_IN49_CHANNEL_IN_POS_IC_1_MASK   0x1C
#define R131_FTDM_IN49_CHANNEL_IN_POS_IC_1_SHIFT  2
#define R131_FTDM_IN49_SERIAL_IN_SEL_IC_1_MASK    0x20
#define R131_FTDM_IN49_SERIAL_IN_SEL_IC_1_SHIFT   5
#define R131_FTDM_IN49_REVERSE_IN_BYTE_IC_1_MASK  0x40
#define R131_FTDM_IN49_REVERSE_IN_BYTE_IC_1_SHIFT 6
#define R131_FTDM_IN49_SLOT_ENABLE_IN_IC_1_MASK   0x80
#define R131_FTDM_IN49_SLOT_ENABLE_IN_IC_1_SHIFT  7

/* FTDM_IN50 (IC 1) */
#define R132_FTDM_IN50_BYTE_IN_POS_IC_1           0x0    /* 00b	[1:0] */
#define R132_FTDM_IN50_CHANNEL_IN_POS_IC_1        0x0    /* 000b	[4:2] */
#define R132_FTDM_IN50_SERIAL_IN_SEL_IC_1         0x0    /* 0b	[5] */
#define R132_FTDM_IN50_REVERSE_IN_BYTE_IC_1       0x0    /* 0b	[6] */
#define R132_FTDM_IN50_SLOT_ENABLE_IN_IC_1        0x0    /* 0b	[7] */
#define R132_FTDM_IN50_BYTE_IN_POS_IC_1_MASK      0x3
#define R132_FTDM_IN50_BYTE_IN_POS_IC_1_SHIFT     0
#define R132_FTDM_IN50_CHANNEL_IN_POS_IC_1_MASK   0x1C
#define R132_FTDM_IN50_CHANNEL_IN_POS_IC_1_SHIFT  2
#define R132_FTDM_IN50_SERIAL_IN_SEL_IC_1_MASK    0x20
#define R132_FTDM_IN50_SERIAL_IN_SEL_IC_1_SHIFT   5
#define R132_FTDM_IN50_REVERSE_IN_BYTE_IC_1_MASK  0x40
#define R132_FTDM_IN50_REVERSE_IN_BYTE_IC_1_SHIFT 6
#define R132_FTDM_IN50_SLOT_ENABLE_IN_IC_1_MASK   0x80
#define R132_FTDM_IN50_SLOT_ENABLE_IN_IC_1_SHIFT  7

/* FTDM_IN51 (IC 1) */
#define R133_FTDM_IN51_BYTE_IN_POS_IC_1           0x0    /* 00b	[1:0] */
#define R133_FTDM_IN51_CHANNEL_IN_POS_IC_1        0x0    /* 000b	[4:2] */
#define R133_FTDM_IN51_SERIAL_IN_SEL_IC_1         0x0    /* 0b	[5] */
#define R133_FTDM_IN51_REVERSE_IN_BYTE_IC_1       0x0    /* 0b	[6] */
#define R133_FTDM_IN51_SLOT_ENABLE_IN_IC_1        0x0    /* 0b	[7] */
#define R133_FTDM_IN51_BYTE_IN_POS_IC_1_MASK      0x3
#define R133_FTDM_IN51_BYTE_IN_POS_IC_1_SHIFT     0
#define R133_FTDM_IN51_CHANNEL_IN_POS_IC_1_MASK   0x1C
#define R133_FTDM_IN51_CHANNEL_IN_POS_IC_1_SHIFT  2
#define R133_FTDM_IN51_SERIAL_IN_SEL_IC_1_MASK    0x20
#define R133_FTDM_IN51_SERIAL_IN_SEL_IC_1_SHIFT   5
#define R133_FTDM_IN51_REVERSE_IN_BYTE_IC_1_MASK  0x40
#define R133_FTDM_IN51_REVERSE_IN_BYTE_IC_1_SHIFT 6
#define R133_FTDM_IN51_SLOT_ENABLE_IN_IC_1_MASK   0x80
#define R133_FTDM_IN51_SLOT_ENABLE_IN_IC_1_SHIFT  7

/* FTDM_IN52 (IC 1) */
#define R134_FTDM_IN52_BYTE_IN_POS_IC_1           0x0    /* 00b	[1:0] */
#define R134_FTDM_IN52_CHANNEL_IN_POS_IC_1        0x0    /* 000b	[4:2] */
#define R134_FTDM_IN52_SERIAL_IN_SEL_IC_1         0x0    /* 0b	[5] */
#define R134_FTDM_IN52_REVERSE_IN_BYTE_IC_1       0x0    /* 0b	[6] */
#define R134_FTDM_IN52_SLOT_ENABLE_IN_IC_1        0x0    /* 0b	[7] */
#define R134_FTDM_IN52_BYTE_IN_POS_IC_1_MASK      0x3
#define R134_FTDM_IN52_BYTE_IN_POS_IC_1_SHIFT     0
#define R134_FTDM_IN52_CHANNEL_IN_POS_IC_1_MASK   0x1C
#define R134_FTDM_IN52_CHANNEL_IN_POS_IC_1_SHIFT  2
#define R134_FTDM_IN52_SERIAL_IN_SEL_IC_1_MASK    0x20
#define R134_FTDM_IN52_SERIAL_IN_SEL_IC_1_SHIFT   5
#define R134_FTDM_IN52_REVERSE_IN_BYTE_IC_1_MASK  0x40
#define R134_FTDM_IN52_REVERSE_IN_BYTE_IC_1_SHIFT 6
#define R134_FTDM_IN52_SLOT_ENABLE_IN_IC_1_MASK   0x80
#define R134_FTDM_IN52_SLOT_ENABLE_IN_IC_1_SHIFT  7

/* FTDM_IN53 (IC 1) */
#define R135_FTDM_IN53_BYTE_IN_POS_IC_1           0x0    /* 00b	[1:0] */
#define R135_FTDM_IN53_CHANNEL_IN_POS_IC_1        0x0    /* 000b	[4:2] */
#define R135_FTDM_IN53_SERIAL_IN_SEL_IC_1         0x0    /* 0b	[5] */
#define R135_FTDM_IN53_REVERSE_IN_BYTE_IC_1       0x0    /* 0b	[6] */
#define R135_FTDM_IN53_SLOT_ENABLE_IN_IC_1        0x0    /* 0b	[7] */
#define R135_FTDM_IN53_BYTE_IN_POS_IC_1_MASK      0x3
#define R135_FTDM_IN53_BYTE_IN_POS_IC_1_SHIFT     0
#define R135_FTDM_IN53_CHANNEL_IN_POS_IC_1_MASK   0x1C
#define R135_FTDM_IN53_CHANNEL_IN_POS_IC_1_SHIFT  2
#define R135_FTDM_IN53_SERIAL_IN_SEL_IC_1_MASK    0x20
#define R135_FTDM_IN53_SERIAL_IN_SEL_IC_1_SHIFT   5
#define R135_FTDM_IN53_REVERSE_IN_BYTE_IC_1_MASK  0x40
#define R135_FTDM_IN53_REVERSE_IN_BYTE_IC_1_SHIFT 6
#define R135_FTDM_IN53_SLOT_ENABLE_IN_IC_1_MASK   0x80
#define R135_FTDM_IN53_SLOT_ENABLE_IN_IC_1_SHIFT  7

/* FTDM_IN54 (IC 1) */
#define R136_FTDM_IN54_BYTE_IN_POS_IC_1           0x0    /* 00b	[1:0] */
#define R136_FTDM_IN54_CHANNEL_IN_POS_IC_1        0x0    /* 000b	[4:2] */
#define R136_FTDM_IN54_SERIAL_IN_SEL_IC_1         0x0    /* 0b	[5] */
#define R136_FTDM_IN54_REVERSE_IN_BYTE_IC_1       0x0    /* 0b	[6] */
#define R136_FTDM_IN54_SLOT_ENABLE_IN_IC_1        0x0    /* 0b	[7] */
#define R136_FTDM_IN54_BYTE_IN_POS_IC_1_MASK      0x3
#define R136_FTDM_IN54_BYTE_IN_POS_IC_1_SHIFT     0
#define R136_FTDM_IN54_CHANNEL_IN_POS_IC_1_MASK   0x1C
#define R136_FTDM_IN54_CHANNEL_IN_POS_IC_1_SHIFT  2
#define R136_FTDM_IN54_SERIAL_IN_SEL_IC_1_MASK    0x20
#define R136_FTDM_IN54_SERIAL_IN_SEL_IC_1_SHIFT   5
#define R136_FTDM_IN54_REVERSE_IN_BYTE_IC_1_MASK  0x40
#define R136_FTDM_IN54_REVERSE_IN_BYTE_IC_1_SHIFT 6
#define R136_FTDM_IN54_SLOT_ENABLE_IN_IC_1_MASK   0x80
#define R136_FTDM_IN54_SLOT_ENABLE_IN_IC_1_SHIFT  7

/* FTDM_IN55 (IC 1) */
#define R137_FTDM_IN55_BYTE_IN_POS_IC_1           0x0    /* 00b	[1:0] */
#define R137_FTDM_IN55_CHANNEL_IN_POS_IC_1        0x0    /* 000b	[4:2] */
#define R137_FTDM_IN55_SERIAL_IN_SEL_IC_1         0x0    /* 0b	[5] */
#define R137_FTDM_IN55_REVERSE_IN_BYTE_IC_1       0x0    /* 0b	[6] */
#define R137_FTDM_IN55_SLOT_ENABLE_IN_IC_1        0x0    /* 0b	[7] */
#define R137_FTDM_IN55_BYTE_IN_POS_IC_1_MASK      0x3
#define R137_FTDM_IN55_BYTE_IN_POS_IC_1_SHIFT     0
#define R137_FTDM_IN55_CHANNEL_IN_POS_IC_1_MASK   0x1C
#define R137_FTDM_IN55_CHANNEL_IN_POS_IC_1_SHIFT  2
#define R137_FTDM_IN55_SERIAL_IN_SEL_IC_1_MASK    0x20
#define R137_FTDM_IN55_SERIAL_IN_SEL_IC_1_SHIFT   5
#define R137_FTDM_IN55_REVERSE_IN_BYTE_IC_1_MASK  0x40
#define R137_FTDM_IN55_REVERSE_IN_BYTE_IC_1_SHIFT 6
#define R137_FTDM_IN55_SLOT_ENABLE_IN_IC_1_MASK   0x80
#define R137_FTDM_IN55_SLOT_ENABLE_IN_IC_1_SHIFT  7

