LeanderGlanda/endstufe-esp32/src/sigmastudio/systemfiles_IC_1_REG.h
/* FTDM_IN56 (IC 1) */
#define R138_FTDM_IN56_BYTE_IN_POS_IC_1           0x0    /* 00b	[1:0] */
#define R138_FTDM_IN56_CHANNEL_IN_POS_IC_1        0x0    /* 000b	[4:2] */
#define R138_FTDM_IN56_SERIAL_IN_SEL_IC_1         0x0    /* 0b	[5] */
#define R138_FTDM_IN56_REVERSE_IN_BYTE_IC_1       0x0    /* 0b	[6] */
#define R138_FTDM_IN56_SLOT_ENABLE_IN_IC_1        0x0    /* 0b	[7] */
#define R138_FTDM_IN56_BYTE_IN_POS_IC_1_MASK      0x3
#define R138_FTDM_IN56_BYTE_IN_POS_IC_1_SHIFT     0
#define R138_FTDM_IN56_CHANNEL_IN_POS_IC_1_MASK   0x1C
#define R138_FTDM_IN56_CHANNEL_IN_POS_IC_1_SHIFT  2
#define R138_FTDM_IN56_SERIAL_IN_SEL_IC_1_MASK    0x20
#define R138_FTDM_IN56_SERIAL_IN_SEL_IC_1_SHIFT   5
#define R138_FTDM_IN56_REVERSE_IN_BYTE_IC_1_MASK  0x40
#define R138_FTDM_IN56_REVERSE_IN_BYTE_IC_1_SHIFT 6
#define R138_FTDM_IN56_SLOT_ENABLE_IN_IC_1_MASK   0x80
#define R138_FTDM_IN56_SLOT_ENABLE_IN_IC_1_SHIFT  7

/* FTDM_IN57 (IC 1) */
#define R139_FTDM_IN57_BYTE_IN_POS_IC_1           0x0    /* 00b	[1:0] */
#define R139_FTDM_IN57_CHANNEL_IN_POS_IC_1        0x0    /* 000b	[4:2] */
#define R139_FTDM_IN57_SERIAL_IN_SEL_IC_1         0x0    /* 0b	[5] */
#define R139_FTDM_IN57_REVERSE_IN_BYTE_IC_1       0x0    /* 0b	[6] */
#define R139_FTDM_IN57_SLOT_ENABLE_IN_IC_1        0x0    /* 0b	[7] */
#define R139_FTDM_IN57_BYTE_IN_POS_IC_1_MASK      0x3
#define R139_FTDM_IN57_BYTE_IN_POS_IC_1_SHIFT     0
#define R139_FTDM_IN57_CHANNEL_IN_POS_IC_1_MASK   0x1C
#define R139_FTDM_IN57_CHANNEL_IN_POS_IC_1_SHIFT  2
#define R139_FTDM_IN57_SERIAL_IN_SEL_IC_1_MASK    0x20
#define R139_FTDM_IN57_SERIAL_IN_SEL_IC_1_SHIFT   5
#define R139_FTDM_IN57_REVERSE_IN_BYTE_IC_1_MASK  0x40
#define R139_FTDM_IN57_REVERSE_IN_BYTE_IC_1_SHIFT 6
#define R139_FTDM_IN57_SLOT_ENABLE_IN_IC_1_MASK   0x80
#define R139_FTDM_IN57_SLOT_ENABLE_IN_IC_1_SHIFT  7

/* FTDM_IN58 (IC 1) */
#define R140_FTDM_IN58_BYTE_IN_POS_IC_1           0x0    /* 00b	[1:0] */
#define R140_FTDM_IN58_CHANNEL_IN_POS_IC_1        0x0    /* 000b	[4:2] */
#define R140_FTDM_IN58_SERIAL_IN_SEL_IC_1         0x0    /* 0b	[5] */
#define R140_FTDM_IN58_REVERSE_IN_BYTE_IC_1       0x0    /* 0b	[6] */
#define R140_FTDM_IN58_SLOT_ENABLE_IN_IC_1        0x0    /* 0b	[7] */
#define R140_FTDM_IN58_BYTE_IN_POS_IC_1_MASK      0x3
#define R140_FTDM_IN58_BYTE_IN_POS_IC_1_SHIFT     0
#define R140_FTDM_IN58_CHANNEL_IN_POS_IC_1_MASK   0x1C
#define R140_FTDM_IN58_CHANNEL_IN_POS_IC_1_SHIFT  2
#define R140_FTDM_IN58_SERIAL_IN_SEL_IC_1_MASK    0x20
#define R140_FTDM_IN58_SERIAL_IN_SEL_IC_1_SHIFT   5
#define R140_FTDM_IN58_REVERSE_IN_BYTE_IC_1_MASK  0x40
#define R140_FTDM_IN58_REVERSE_IN_BYTE_IC_1_SHIFT 6
#define R140_FTDM_IN58_SLOT_ENABLE_IN_IC_1_MASK   0x80
#define R140_FTDM_IN58_SLOT_ENABLE_IN_IC_1_SHIFT  7

/* FTDM_IN59 (IC 1) */
#define R141_FTDM_IN59_BYTE_IN_POS_IC_1           0x0    /* 00b	[1:0] */
#define R141_FTDM_IN59_CHANNEL_IN_POS_IC_1        0x0    /* 000b	[4:2] */
#define R141_FTDM_IN59_SERIAL_IN_SEL_IC_1         0x0    /* 0b	[5] */
#define R141_FTDM_IN59_REVERSE_IN_BYTE_IC_1       0x0    /* 0b	[6] */
#define R141_FTDM_IN59_SLOT_ENABLE_IN_IC_1        0x0    /* 0b	[7] */
#define R141_FTDM_IN59_BYTE_IN_POS_IC_1_MASK      0x3
#define R141_FTDM_IN59_BYTE_IN_POS_IC_1_SHIFT     0
#define R141_FTDM_IN59_CHANNEL_IN_POS_IC_1_MASK   0x1C
#define R141_FTDM_IN59_CHANNEL_IN_POS_IC_1_SHIFT  2
#define R141_FTDM_IN59_SERIAL_IN_SEL_IC_1_MASK    0x20
#define R141_FTDM_IN59_SERIAL_IN_SEL_IC_1_SHIFT   5
#define R141_FTDM_IN59_REVERSE_IN_BYTE_IC_1_MASK  0x40
#define R141_FTDM_IN59_REVERSE_IN_BYTE_IC_1_SHIFT 6
#define R141_FTDM_IN59_SLOT_ENABLE_IN_IC_1_MASK   0x80
#define R141_FTDM_IN59_SLOT_ENABLE_IN_IC_1_SHIFT  7

/* FTDM_IN60 (IC 1) */
#define R142_FTDM_IN60_BYTE_IN_POS_IC_1           0x0    /* 00b	[1:0] */
#define R142_FTDM_IN60_CHANNEL_IN_POS_IC_1        0x0    /* 000b	[4:2] */
#define R142_FTDM_IN60_SERIAL_IN_SEL_IC_1         0x0    /* 0b	[5] */
#define R142_FTDM_IN60_REVERSE_IN_BYTE_IC_1       0x0    /* 0b	[6] */
#define R142_FTDM_IN60_SLOT_ENABLE_IN_IC_1        0x0    /* 0b	[7] */
#define R142_FTDM_IN60_BYTE_IN_POS_IC_1_MASK      0x3
#define R142_FTDM_IN60_BYTE_IN_POS_IC_1_SHIFT     0
#define R142_FTDM_IN60_CHANNEL_IN_POS_IC_1_MASK   0x1C
#define R142_FTDM_IN60_CHANNEL_IN_POS_IC_1_SHIFT  2
#define R142_FTDM_IN60_SERIAL_IN_SEL_IC_1_MASK    0x20
#define R142_FTDM_IN60_SERIAL_IN_SEL_IC_1_SHIFT   5
#define R142_FTDM_IN60_REVERSE_IN_BYTE_IC_1_MASK  0x40
#define R142_FTDM_IN60_REVERSE_IN_BYTE_IC_1_SHIFT 6
#define R142_FTDM_IN60_SLOT_ENABLE_IN_IC_1_MASK   0x80
#define R142_FTDM_IN60_SLOT_ENABLE_IN_IC_1_SHIFT  7

/* FTDM_IN61 (IC 1) */
#define R143_FTDM_IN61_BYTE_IN_POS_IC_1           0x0    /* 00b	[1:0] */
#define R143_FTDM_IN61_CHANNEL_IN_POS_IC_1        0x0    /* 000b	[4:2] */
#define R143_FTDM_IN61_SERIAL_IN_SEL_IC_1         0x0    /* 0b	[5] */
#define R143_FTDM_IN61_REVERSE_IN_BYTE_IC_1       0x0    /* 0b	[6] */
#define R143_FTDM_IN61_SLOT_ENABLE_IN_IC_1        0x0    /* 0b	[7] */
#define R143_FTDM_IN61_BYTE_IN_POS_IC_1_MASK      0x3
#define R143_FTDM_IN61_BYTE_IN_POS_IC_1_SHIFT     0
#define R143_FTDM_IN61_CHANNEL_IN_POS_IC_1_MASK   0x1C
#define R143_FTDM_IN61_CHANNEL_IN_POS_IC_1_SHIFT  2
#define R143_FTDM_IN61_SERIAL_IN_SEL_IC_1_MASK    0x20
#define R143_FTDM_IN61_SERIAL_IN_SEL_IC_1_SHIFT   5
#define R143_FTDM_IN61_REVERSE_IN_BYTE_IC_1_MASK  0x40
#define R143_FTDM_IN61_REVERSE_IN_BYTE_IC_1_SHIFT 6
#define R143_FTDM_IN61_SLOT_ENABLE_IN_IC_1_MASK   0x80
#define R143_FTDM_IN61_SLOT_ENABLE_IN_IC_1_SHIFT  7

/* FTDM_IN62 (IC 1) */
#define R144_FTDM_IN62_BYTE_IN_POS_IC_1           0x0    /* 00b	[1:0] */
#define R144_FTDM_IN62_CHANNEL_IN_POS_IC_1        0x0    /* 000b	[4:2] */
#define R144_FTDM_IN62_SERIAL_IN_SEL_IC_1         0x0    /* 0b	[5] */
#define R144_FTDM_IN62_REVERSE_IN_BYTE_IC_1       0x0    /* 0b	[6] */
#define R144_FTDM_IN62_SLOT_ENABLE_IN_IC_1        0x0    /* 0b	[7] */
#define R144_FTDM_IN62_BYTE_IN_POS_IC_1_MASK      0x3
#define R144_FTDM_IN62_BYTE_IN_POS_IC_1_SHIFT     0
#define R144_FTDM_IN62_CHANNEL_IN_POS_IC_1_MASK   0x1C
#define R144_FTDM_IN62_CHANNEL_IN_POS_IC_1_SHIFT  2
#define R144_FTDM_IN62_SERIAL_IN_SEL_IC_1_MASK    0x20
#define R144_FTDM_IN62_SERIAL_IN_SEL_IC_1_SHIFT   5
#define R144_FTDM_IN62_REVERSE_IN_BYTE_IC_1_MASK  0x40
#define R144_FTDM_IN62_REVERSE_IN_BYTE_IC_1_SHIFT 6
#define R144_FTDM_IN62_SLOT_ENABLE_IN_IC_1_MASK   0x80
#define R144_FTDM_IN62_SLOT_ENABLE_IN_IC_1_SHIFT  7

/* FTDM_IN63 (IC 1) */
#define R145_FTDM_IN63_BYTE_IN_POS_IC_1           0x0    /* 00b	[1:0] */
#define R145_FTDM_IN63_CHANNEL_IN_POS_IC_1        0x0    /* 000b	[4:2] */
#define R145_FTDM_IN63_SERIAL_IN_SEL_IC_1         0x0    /* 0b	[5] */
#define R145_FTDM_IN63_REVERSE_IN_BYTE_IC_1       0x0    /* 0b	[6] */
#define R145_FTDM_IN63_SLOT_ENABLE_IN_IC_1        0x0    /* 0b	[7] */
#define R145_FTDM_IN63_BYTE_IN_POS_IC_1_MASK      0x3
#define R145_FTDM_IN63_BYTE_IN_POS_IC_1_SHIFT     0
#define R145_FTDM_IN63_CHANNEL_IN_POS_IC_1_MASK   0x1C
#define R145_FTDM_IN63_CHANNEL_IN_POS_IC_1_SHIFT  2
#define R145_FTDM_IN63_SERIAL_IN_SEL_IC_1_MASK    0x20
#define R145_FTDM_IN63_SERIAL_IN_SEL_IC_1_SHIFT   5
#define R145_FTDM_IN63_REVERSE_IN_BYTE_IC_1_MASK  0x40
#define R145_FTDM_IN63_REVERSE_IN_BYTE_IC_1_SHIFT 6
#define R145_FTDM_IN63_SLOT_ENABLE_IN_IC_1_MASK   0x80
#define R145_FTDM_IN63_SLOT_ENABLE_IN_IC_1_SHIFT  7

/* FTDM_OUT0 (IC 1) */
#define R146_FTDM_OUT0_BYTE_OUT_POS_IC_1          0x0    /* 00b	[1:0] */
#define R146_FTDM_OUT0_CHANNEL_OUT_POS_IC_1       0x0    /* 000b	[4:2] */
#define R146_FTDM_OUT0_SERIAL_OUT_SEL_IC_1        0x0    /* 0b	[5] */
#define R146_FTDM_OUT0_REVERSE_OUT_BYTE_IC_1      0x0    /* 0b	[6] */
#define R146_FTDM_OUT0_SLOT_ENABLE_OUT_IC_1       0x0    /* 0b	[7] */
#define R146_FTDM_OUT0_BYTE_OUT_POS_IC_1_MASK     0x3
#define R146_FTDM_OUT0_BYTE_OUT_POS_IC_1_SHIFT    0
#define R146_FTDM_OUT0_CHANNEL_OUT_POS_IC_1_MASK  0x1C
#define R146_FTDM_OUT0_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R146_FTDM_OUT0_SERIAL_OUT_SEL_IC_1_MASK   0x20
#define R146_FTDM_OUT0_SERIAL_OUT_SEL_IC_1_SHIFT  5
#define R146_FTDM_OUT0_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R146_FTDM_OUT0_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R146_FTDM_OUT0_SLOT_ENABLE_OUT_IC_1_MASK  0x80
#define R146_FTDM_OUT0_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT1 (IC 1) */
#define R147_FTDM_OUT1_BYTE_OUT_POS_IC_1          0x0    /* 00b	[1:0] */
#define R147_FTDM_OUT1_CHANNEL_OUT_POS_IC_1       0x0    /* 000b	[4:2] */
#define R147_FTDM_OUT1_SERIAL_OUT_SEL_IC_1        0x0    /* 0b	[5] */
#define R147_FTDM_OUT1_REVERSE_OUT_BYTE_IC_1      0x0    /* 0b	[6] */
#define R147_FTDM_OUT1_SLOT_ENABLE_OUT_IC_1       0x0    /* 0b	[7] */
#define R147_FTDM_OUT1_BYTE_OUT_POS_IC_1_MASK     0x3
#define R147_FTDM_OUT1_BYTE_OUT_POS_IC_1_SHIFT    0
#define R147_FTDM_OUT1_CHANNEL_OUT_POS_IC_1_MASK  0x1C
#define R147_FTDM_OUT1_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R147_FTDM_OUT1_SERIAL_OUT_SEL_IC_1_MASK   0x20
#define R147_FTDM_OUT1_SERIAL_OUT_SEL_IC_1_SHIFT  5
#define R147_FTDM_OUT1_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R147_FTDM_OUT1_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R147_FTDM_OUT1_SLOT_ENABLE_OUT_IC_1_MASK  0x80
#define R147_FTDM_OUT1_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT2 (IC 1) */
#define R148_FTDM_OUT2_BYTE_OUT_POS_IC_1          0x0    /* 00b	[1:0] */
#define R148_FTDM_OUT2_CHANNEL_OUT_POS_IC_1       0x0    /* 000b	[4:2] */
#define R148_FTDM_OUT2_SERIAL_OUT_SEL_IC_1        0x0    /* 0b	[5] */
#define R148_FTDM_OUT2_REVERSE_OUT_BYTE_IC_1      0x0    /* 0b	[6] */
#define R148_FTDM_OUT2_SLOT_ENABLE_OUT_IC_1       0x0    /* 0b	[7] */
#define R148_FTDM_OUT2_BYTE_OUT_POS_IC_1_MASK     0x3
#define R148_FTDM_OUT2_BYTE_OUT_POS_IC_1_SHIFT    0
#define R148_FTDM_OUT2_CHANNEL_OUT_POS_IC_1_MASK  0x1C
#define R148_FTDM_OUT2_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R148_FTDM_OUT2_SERIAL_OUT_SEL_IC_1_MASK   0x20
#define R148_FTDM_OUT2_SERIAL_OUT_SEL_IC_1_SHIFT  5
#define R148_FTDM_OUT2_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R148_FTDM_OUT2_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R148_FTDM_OUT2_SLOT_ENABLE_OUT_IC_1_MASK  0x80
#define R148_FTDM_OUT2_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT3 (IC 1) */
#define R149_FTDM_OUT3_BYTE_OUT_POS_IC_1          0x0    /* 00b	[1:0] */
#define R149_FTDM_OUT3_CHANNEL_OUT_POS_IC_1       0x0    /* 000b	[4:2] */
#define R149_FTDM_OUT3_SERIAL_OUT_SEL_IC_1        0x0    /* 0b	[5] */
#define R149_FTDM_OUT3_REVERSE_OUT_BYTE_IC_1      0x0    /* 0b	[6] */
#define R149_FTDM_OUT3_SLOT_ENABLE_OUT_IC_1       0x0    /* 0b	[7] */
#define R149_FTDM_OUT3_BYTE_OUT_POS_IC_1_MASK     0x3
#define R149_FTDM_OUT3_BYTE_OUT_POS_IC_1_SHIFT    0
#define R149_FTDM_OUT3_CHANNEL_OUT_POS_IC_1_MASK  0x1C
#define R149_FTDM_OUT3_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R149_FTDM_OUT3_SERIAL_OUT_SEL_IC_1_MASK   0x20
#define R149_FTDM_OUT3_SERIAL_OUT_SEL_IC_1_SHIFT  5
#define R149_FTDM_OUT3_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R149_FTDM_OUT3_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R149_FTDM_OUT3_SLOT_ENABLE_OUT_IC_1_MASK  0x80
#define R149_FTDM_OUT3_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT4 (IC 1) */
#define R150_FTDM_OUT4_BYTE_OUT_POS_IC_1          0x0    /* 00b	[1:0] */
#define R150_FTDM_OUT4_CHANNEL_OUT_POS_IC_1       0x0    /* 000b	[4:2] */
#define R150_FTDM_OUT4_SERIAL_OUT_SEL_IC_1        0x0    /* 0b	[5] */
#define R150_FTDM_OUT4_REVERSE_OUT_BYTE_IC_1      0x0    /* 0b	[6] */
#define R150_FTDM_OUT4_SLOT_ENABLE_OUT_IC_1       0x0    /* 0b	[7] */
#define R150_FTDM_OUT4_BYTE_OUT_POS_IC_1_MASK     0x3
#define R150_FTDM_OUT4_BYTE_OUT_POS_IC_1_SHIFT    0
#define R150_FTDM_OUT4_CHANNEL_OUT_POS_IC_1_MASK  0x1C
#define R150_FTDM_OUT4_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R150_FTDM_OUT4_SERIAL_OUT_SEL_IC_1_MASK   0x20
#define R150_FTDM_OUT4_SERIAL_OUT_SEL_IC_1_SHIFT  5
#define R150_FTDM_OUT4_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R150_FTDM_OUT4_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R150_FTDM_OUT4_SLOT_ENABLE_OUT_IC_1_MASK  0x80
#define R150_FTDM_OUT4_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT5 (IC 1) */
#define R151_FTDM_OUT5_BYTE_OUT_POS_IC_1          0x0    /* 00b	[1:0] */
#define R151_FTDM_OUT5_CHANNEL_OUT_POS_IC_1       0x0    /* 000b	[4:2] */
#define R151_FTDM_OUT5_SERIAL_OUT_SEL_IC_1        0x0    /* 0b	[5] */
#define R151_FTDM_OUT5_REVERSE_OUT_BYTE_IC_1      0x0    /* 0b	[6] */
#define R151_FTDM_OUT5_SLOT_ENABLE_OUT_IC_1       0x0    /* 0b	[7] */
#define R151_FTDM_OUT5_BYTE_OUT_POS_IC_1_MASK     0x3
#define R151_FTDM_OUT5_BYTE_OUT_POS_IC_1_SHIFT    0
#define R151_FTDM_OUT5_CHANNEL_OUT_POS_IC_1_MASK  0x1C
#define R151_FTDM_OUT5_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R151_FTDM_OUT5_SERIAL_OUT_SEL_IC_1_MASK   0x20
#define R151_FTDM_OUT5_SERIAL_OUT_SEL_IC_1_SHIFT  5
#define R151_FTDM_OUT5_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R151_FTDM_OUT5_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R151_FTDM_OUT5_SLOT_ENABLE_OUT_IC_1_MASK  0x80
#define R151_FTDM_OUT5_SLOT_ENABLE_OUT_IC_1_SHIFT 7

