LeanderGlanda/endstufe-esp32/src/sigmastudio/systemfiles_IC_1_REG.h
/* FTDM_OUT59 (IC 1) */
#define R205_FTDM_OUT59_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R205_FTDM_OUT59_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R205_FTDM_OUT59_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R205_FTDM_OUT59_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R205_FTDM_OUT59_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R205_FTDM_OUT59_BYTE_OUT_POS_IC_1_MASK    0x3
#define R205_FTDM_OUT59_BYTE_OUT_POS_IC_1_SHIFT   0
#define R205_FTDM_OUT59_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R205_FTDM_OUT59_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R205_FTDM_OUT59_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R205_FTDM_OUT59_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R205_FTDM_OUT59_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R205_FTDM_OUT59_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R205_FTDM_OUT59_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R205_FTDM_OUT59_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT60 (IC 1) */
#define R206_FTDM_OUT60_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R206_FTDM_OUT60_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R206_FTDM_OUT60_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R206_FTDM_OUT60_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R206_FTDM_OUT60_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R206_FTDM_OUT60_BYTE_OUT_POS_IC_1_MASK    0x3
#define R206_FTDM_OUT60_BYTE_OUT_POS_IC_1_SHIFT   0
#define R206_FTDM_OUT60_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R206_FTDM_OUT60_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R206_FTDM_OUT60_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R206_FTDM_OUT60_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R206_FTDM_OUT60_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R206_FTDM_OUT60_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R206_FTDM_OUT60_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R206_FTDM_OUT60_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT61 (IC 1) */
#define R207_FTDM_OUT61_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R207_FTDM_OUT61_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R207_FTDM_OUT61_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R207_FTDM_OUT61_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R207_FTDM_OUT61_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R207_FTDM_OUT61_BYTE_OUT_POS_IC_1_MASK    0x3
#define R207_FTDM_OUT61_BYTE_OUT_POS_IC_1_SHIFT   0
#define R207_FTDM_OUT61_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R207_FTDM_OUT61_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R207_FTDM_OUT61_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R207_FTDM_OUT61_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R207_FTDM_OUT61_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R207_FTDM_OUT61_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R207_FTDM_OUT61_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R207_FTDM_OUT61_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT62 (IC 1) */
#define R208_FTDM_OUT62_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R208_FTDM_OUT62_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R208_FTDM_OUT62_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R208_FTDM_OUT62_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R208_FTDM_OUT62_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R208_FTDM_OUT62_BYTE_OUT_POS_IC_1_MASK    0x3
#define R208_FTDM_OUT62_BYTE_OUT_POS_IC_1_SHIFT   0
#define R208_FTDM_OUT62_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R208_FTDM_OUT62_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R208_FTDM_OUT62_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R208_FTDM_OUT62_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R208_FTDM_OUT62_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R208_FTDM_OUT62_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R208_FTDM_OUT62_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R208_FTDM_OUT62_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT63 (IC 1) */
#define R209_FTDM_OUT63_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R209_FTDM_OUT63_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R209_FTDM_OUT63_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R209_FTDM_OUT63_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R209_FTDM_OUT63_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R209_FTDM_OUT63_BYTE_OUT_POS_IC_1_MASK    0x3
#define R209_FTDM_OUT63_BYTE_OUT_POS_IC_1_SHIFT   0
#define R209_FTDM_OUT63_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R209_FTDM_OUT63_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R209_FTDM_OUT63_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R209_FTDM_OUT63_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R209_FTDM_OUT63_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R209_FTDM_OUT63_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R209_FTDM_OUT63_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R209_FTDM_OUT63_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* HIBERNATE (IC 1) */
#define R210_HIBERNATE_HIBERNATE_IC_1             0x1    /* 1b	[0] */
#define R210_HIBERNATE_HIBERNATE_IC_1_MASK        0x1
#define R210_HIBERNATE_HIBERNATE_IC_1_SHIFT       0

/* START_PULSE (IC 1) */
#define R211_START_PULSE_START_PULSE_IC_1         0x2    /* 00010b	[4:0] */
#define R211_START_PULSE_START_PULSE_IC_1_MASK    0x1F
#define R211_START_PULSE_START_PULSE_IC_1_SHIFT   0

/* START_CORE (IC 1) */
#define R212_START_CORE_START_CORE_IC_1           0x1    /* 1b	[0] */
#define R212_START_CORE_START_CORE_IC_1_MASK      0x1
#define R212_START_CORE_START_CORE_IC_1_SHIFT     0

/* KILL_CORE (IC 1) */
#define R213_KILL_CORE_KILL_CORE_IC_1             0x1    /* 1b	[0] */
#define R213_KILL_CORE_KILL_CORE_IC_1_MASK        0x1
#define R213_KILL_CORE_KILL_CORE_IC_1_SHIFT       0

/* START_ADDRESS (IC 1) */
#define R214_START_ADDRESS_START_ADDRESS_IC_1     0x0000 /* 0000000000000000b	[15:0] */
#define R214_START_ADDRESS_START_ADDRESS_IC_1_MASK 0xFFFF
#define R214_START_ADDRESS_START_ADDRESS_IC_1_SHIFT 0

/* CORE_STATUS (IC 1) */
#define R215_CORE_STATUS_CORE_STATUS_IC_1         0x0    /* 000b	[2:0] */
#define R215_CORE_STATUS_CORE_STATUS_IC_1_MASK    0x7
#define R215_CORE_STATUS_CORE_STATUS_IC_1_SHIFT   0

/* PANIC_CLEAR (IC 1) */
#define R216_PANIC_CLEAR_PANIC_CLEAR_IC_1         0x0    /* 0b	[0] */
#define R216_PANIC_CLEAR_PANIC_CLEAR_IC_1_MASK    0x1
#define R216_PANIC_CLEAR_PANIC_CLEAR_IC_1_SHIFT   0

/* PANIC_PARITY_MASK (IC 1) */
#define R217_PANIC_PARITY_MASK_ASRC0_MASK_IC_1    0x1    /* 1b	[0] */
#define R217_PANIC_PARITY_MASK_ASRC1_MASK_IC_1    0x1    /* 1b	[1] */
#define R217_PANIC_PARITY_MASK_PM0_MASK_IC_1      0x0    /* 0b	[2] */
#define R217_PANIC_PARITY_MASK_PM1_MASK_IC_1      0x0    /* 0b	[3] */
#define R217_PANIC_PARITY_MASK_DM0_BANK0_MASK_IC_1 0x0   /* 0b	[4] */
#define R217_PANIC_PARITY_MASK_DM0_BANK1_MASK_IC_1 0x0   /* 0b	[5] */
#define R217_PANIC_PARITY_MASK_DM0_BANK2_MASK_IC_1 0x0   /* 0b	[6] */
#define R217_PANIC_PARITY_MASK_DM0_BANK3_MASK_IC_1 0x0   /* 0b	[7] */
#define R217_PANIC_PARITY_MASK_DM1_BANK0_MASK_IC_1 0x0   /* 0b	[8] */
#define R217_PANIC_PARITY_MASK_DM1_BANK1_MASK_IC_1 0x0   /* 0b	[9] */
#define R217_PANIC_PARITY_MASK_DM1_BANK2_MASK_IC_1 0x0   /* 0b	[10] */
#define R217_PANIC_PARITY_MASK_DM1_BANK3_MASK_IC_1 0x0   /* 0b	[11] */
#define R217_PANIC_PARITY_MASK_ASRC0_MASK_IC_1_MASK 0x1
#define R217_PANIC_PARITY_MASK_ASRC0_MASK_IC_1_SHIFT 0
#define R217_PANIC_PARITY_MASK_ASRC1_MASK_IC_1_MASK 0x2
#define R217_PANIC_PARITY_MASK_ASRC1_MASK_IC_1_SHIFT 1
#define R217_PANIC_PARITY_MASK_PM0_MASK_IC_1_MASK 0x4
#define R217_PANIC_PARITY_MASK_PM0_MASK_IC_1_SHIFT 2
#define R217_PANIC_PARITY_MASK_PM1_MASK_IC_1_MASK 0x8
#define R217_PANIC_PARITY_MASK_PM1_MASK_IC_1_SHIFT 3
#define R217_PANIC_PARITY_MASK_DM0_BANK0_MASK_IC_1_MASK 0x10
#define R217_PANIC_PARITY_MASK_DM0_BANK0_MASK_IC_1_SHIFT 4
#define R217_PANIC_PARITY_MASK_DM0_BANK1_MASK_IC_1_MASK 0x20
#define R217_PANIC_PARITY_MASK_DM0_BANK1_MASK_IC_1_SHIFT 5
#define R217_PANIC_PARITY_MASK_DM0_BANK2_MASK_IC_1_MASK 0x40
#define R217_PANIC_PARITY_MASK_DM0_BANK2_MASK_IC_1_SHIFT 6
#define R217_PANIC_PARITY_MASK_DM0_BANK3_MASK_IC_1_MASK 0x80
#define R217_PANIC_PARITY_MASK_DM0_BANK3_MASK_IC_1_SHIFT 7
#define R217_PANIC_PARITY_MASK_DM1_BANK0_MASK_IC_1_MASK 0x100
#define R217_PANIC_PARITY_MASK_DM1_BANK0_MASK_IC_1_SHIFT 8
#define R217_PANIC_PARITY_MASK_DM1_BANK1_MASK_IC_1_MASK 0x200
#define R217_PANIC_PARITY_MASK_DM1_BANK1_MASK_IC_1_SHIFT 9
#define R217_PANIC_PARITY_MASK_DM1_BANK2_MASK_IC_1_MASK 0x400
#define R217_PANIC_PARITY_MASK_DM1_BANK2_MASK_IC_1_SHIFT 10
#define R217_PANIC_PARITY_MASK_DM1_BANK3_MASK_IC_1_MASK 0x800
#define R217_PANIC_PARITY_MASK_DM1_BANK3_MASK_IC_1_SHIFT 11

