LeanderGlanda/endstufe-esp32/src/sigmastudio/systemfiles_IC_1_REG.h
/* PANIC_SOFTWARE_MASK (IC 1) */
#define R218_PANIC_SOFTWARE_MASK_PANIC_SOFTWARE_IC_1 0x0 /* 0b	[0] */
#define R218_PANIC_SOFTWARE_MASK_PANIC_SOFTWARE_IC_1_MASK 0x1
#define R218_PANIC_SOFTWARE_MASK_PANIC_SOFTWARE_IC_1_SHIFT 0

/* PANIC_WD_MASK (IC 1) */
#define R219_PANIC_WD_MASK_PANIC_WD_IC_1          0x0    /* 0b	[0] */
#define R219_PANIC_WD_MASK_PANIC_WD_IC_1_MASK     0x1
#define R219_PANIC_WD_MASK_PANIC_WD_IC_1_SHIFT    0

/* PANIC_STACK_MASK (IC 1) */
#define R220_PANIC_STACK_MASK_PANIC_STACK_IC_1    0x0    /* 0b	[0] */
#define R220_PANIC_STACK_MASK_PANIC_STACK_IC_1_MASK 0x1
#define R220_PANIC_STACK_MASK_PANIC_STACK_IC_1_SHIFT 0

/* PANIC_LOOP_MASK (IC 1) */
#define R221_PANIC_LOOP_MASK_PANIC_LOOP_IC_1      0x0    /* 0b	[0] */
#define R221_PANIC_LOOP_MASK_PANIC_LOOP_IC_1_MASK 0x1
#define R221_PANIC_LOOP_MASK_PANIC_LOOP_IC_1_SHIFT 0

/* PANIC_FLAG (IC 1) */
#define R222_PANIC_FLAG_PANIC_FLAG_IC_1           0x0    /* 0b	[0] */
#define R222_PANIC_FLAG_PANIC_FLAG_IC_1_MASK      0x1
#define R222_PANIC_FLAG_PANIC_FLAG_IC_1_SHIFT     0

/* PANIC_CODE (IC 1) */
#define R223_PANIC_CODE_ERR_ASRC0_IC_1            0x0    /* 0b	[0] */
#define R223_PANIC_CODE_ERR_ASRC1_IC_1            0x0    /* 0b	[1] */
#define R223_PANIC_CODE_ERR_PM0_IC_1              0x0    /* 0b	[2] */
#define R223_PANIC_CODE_ERR_PM1_IC_1              0x0    /* 0b	[3] */
#define R223_PANIC_CODE_ERR_DM0B0_IC_1            0x0    /* 0b	[4] */
#define R223_PANIC_CODE_ERR_DM0B1_IC_1            0x0    /* 0b	[5] */
#define R223_PANIC_CODE_ERR_DM0B2_IC_1            0x0    /* 0b	[6] */
#define R223_PANIC_CODE_ERR_DM0B3_IC_1            0x0    /* 0b	[7] */
#define R223_PANIC_CODE_ERR_DM1B0_IC_1            0x0    /* 0b	[8] */
#define R223_PANIC_CODE_ERR_DM1B1_IC_1            0x0    /* 0b	[9] */
#define R223_PANIC_CODE_ERR_DM1B2_IC_1            0x0    /* 0b	[10] */
#define R223_PANIC_CODE_ERR_DM1B3_IC_1            0x0    /* 0b	[11] */
#define R223_PANIC_CODE_ERR_WATCHDOG_IC_1         0x0    /* 0b	[12] */
#define R223_PANIC_CODE_ERR_STACK_IC_1            0x0    /* 0b	[13] */
#define R223_PANIC_CODE_ERR_LOOP_IC_1             0x0    /* 0b	[14] */
#define R223_PANIC_CODE_ERR_SOFT_IC_1             0x0    /* 0b	[15] */
#define R223_PANIC_CODE_ERR_ASRC0_IC_1_MASK       0x1
#define R223_PANIC_CODE_ERR_ASRC0_IC_1_SHIFT      0
#define R223_PANIC_CODE_ERR_ASRC1_IC_1_MASK       0x2
#define R223_PANIC_CODE_ERR_ASRC1_IC_1_SHIFT      1
#define R223_PANIC_CODE_ERR_PM0_IC_1_MASK         0x4
#define R223_PANIC_CODE_ERR_PM0_IC_1_SHIFT        2
#define R223_PANIC_CODE_ERR_PM1_IC_1_MASK         0x8
#define R223_PANIC_CODE_ERR_PM1_IC_1_SHIFT        3
#define R223_PANIC_CODE_ERR_DM0B0_IC_1_MASK       0x10
#define R223_PANIC_CODE_ERR_DM0B0_IC_1_SHIFT      4
#define R223_PANIC_CODE_ERR_DM0B1_IC_1_MASK       0x20
#define R223_PANIC_CODE_ERR_DM0B1_IC_1_SHIFT      5
#define R223_PANIC_CODE_ERR_DM0B2_IC_1_MASK       0x40
#define R223_PANIC_CODE_ERR_DM0B2_IC_1_SHIFT      6
#define R223_PANIC_CODE_ERR_DM0B3_IC_1_MASK       0x80
#define R223_PANIC_CODE_ERR_DM0B3_IC_1_SHIFT      7
#define R223_PANIC_CODE_ERR_DM1B0_IC_1_MASK       0x100
#define R223_PANIC_CODE_ERR_DM1B0_IC_1_SHIFT      8
#define R223_PANIC_CODE_ERR_DM1B1_IC_1_MASK       0x200
#define R223_PANIC_CODE_ERR_DM1B1_IC_1_SHIFT      9
#define R223_PANIC_CODE_ERR_DM1B2_IC_1_MASK       0x400
#define R223_PANIC_CODE_ERR_DM1B2_IC_1_SHIFT      10
#define R223_PANIC_CODE_ERR_DM1B3_IC_1_MASK       0x800
#define R223_PANIC_CODE_ERR_DM1B3_IC_1_SHIFT      11
#define R223_PANIC_CODE_ERR_WATCHDOG_IC_1_MASK    0x1000
#define R223_PANIC_CODE_ERR_WATCHDOG_IC_1_SHIFT   12
#define R223_PANIC_CODE_ERR_STACK_IC_1_MASK       0x2000
#define R223_PANIC_CODE_ERR_STACK_IC_1_SHIFT      13
#define R223_PANIC_CODE_ERR_LOOP_IC_1_MASK        0x4000
#define R223_PANIC_CODE_ERR_LOOP_IC_1_SHIFT       14
#define R223_PANIC_CODE_ERR_SOFT_IC_1_MASK        0x8000
#define R223_PANIC_CODE_ERR_SOFT_IC_1_SHIFT       15

/* EXECUTE_COUNT (IC 1) */
#define R224_EXECUTE_COUNT_EXECUTE_COUNT_IC_1     0x0000 /* 0000000000000000b	[15:0] */
#define R224_EXECUTE_COUNT_EXECUTE_COUNT_IC_1_MASK 0xFFFF
#define R224_EXECUTE_COUNT_EXECUTE_COUNT_IC_1_SHIFT 0

/* WATCHDOG_MAXCOUNT (IC 1) */
#define R225_WATCHDOG_MAXCOUNT_WD_MAXCOUNT_IC_1   0x000  /* 0000000000000b	[12:0] */
#define R225_WATCHDOG_MAXCOUNT_WD_MAXCOUNT_IC_1_MASK 0x1FFF
#define R225_WATCHDOG_MAXCOUNT_WD_MAXCOUNT_IC_1_SHIFT 0

/* WATCHDOG_PRESCALE (IC 1) */
#define R226_WATCHDOG_PRESCALE_WD_PRESCALE_IC_1   0x0    /* 0000b	[3:0] */
#define R226_WATCHDOG_PRESCALE_WD_PRESCALE_IC_1_MASK 0xF
#define R226_WATCHDOG_PRESCALE_WD_PRESCALE_IC_1_SHIFT 0

/* BLOCKINT_EN (IC 1) */
#define R227_BLOCKINT_EN_BLOCKINT_EN_IC_1         0x0    /* 0b	[0] */
#define R227_BLOCKINT_EN_BLOCKINT_EN_IC_1_MASK    0x1
#define R227_BLOCKINT_EN_BLOCKINT_EN_IC_1_SHIFT   0

/* BLOCKINT_VALUE (IC 1) */
#define R228_BLOCKINT_VALUE_BLOCKINT_VALUE_IC_1   0x0000 /* 0000000000000000b	[15:0] */
#define R228_BLOCKINT_VALUE_BLOCKINT_VALUE_IC_1_MASK 0xFFFF
#define R228_BLOCKINT_VALUE_BLOCKINT_VALUE_IC_1_SHIFT 0

/* PROG_CNTR0 (IC 1) */
#define R229_PROG_CNTR0_PROG_CNTR_MSB_IC_1        0x00   /* 00000000b	[7:0] */
#define R229_PROG_CNTR0_PROG_CNTR_MSB_IC_1_MASK   0xFF
#define R229_PROG_CNTR0_PROG_CNTR_MSB_IC_1_SHIFT  0

/* PROG_CNTR1 (IC 1) */
#define R230_PROG_CNTR1_PROG_CNTR_LSB_IC_1        0x0000 /* 0000000000000000b	[15:0] */
#define R230_PROG_CNTR1_PROG_CNTR_LSB_IC_1_MASK   0xFFFF
#define R230_PROG_CNTR1_PROG_CNTR_LSB_IC_1_SHIFT  0

/* PROG_CNTR_CLEAR (IC 1) */
#define R231_PROG_CNTR_CLEAR_PROG_CNTR_CLEAR_IC_1 0x0    /* 0b	[0] */
#define R231_PROG_CNTR_CLEAR_PROG_CNTR_CLEAR_IC_1_MASK 0x1
#define R231_PROG_CNTR_CLEAR_PROG_CNTR_CLEAR_IC_1_SHIFT 0

/* PROG_CNTR_LENGTH0 (IC 1) */
#define R232_PROG_CNTR_LENGTH0_PROG_LENGTH_MSB_IC_1 0x00 /* 00000000b	[7:0] */
#define R232_PROG_CNTR_LENGTH0_PROG_LENGTH_MSB_IC_1_MASK 0xFF
#define R232_PROG_CNTR_LENGTH0_PROG_LENGTH_MSB_IC_1_SHIFT 0

/* PROG_CNTR_LENGTH1 (IC 1) */
#define R233_PROG_CNTR_LENGTH1_PROG_LENGTH_LSB_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R233_PROG_CNTR_LENGTH1_PROG_LENGTH_LSB_IC_1_MASK 0xFFFF
#define R233_PROG_CNTR_LENGTH1_PROG_LENGTH_LSB_IC_1_SHIFT 0

/* PROG_CNTR_MAXLENGTH0 (IC 1) */
#define R234_PROG_CNTR_MAXLENGTH0_PROG_MAXLENGTH_MSB_IC_1 0x00 /* 00000000b	[7:0] */
#define R234_PROG_CNTR_MAXLENGTH0_PROG_MAXLENGTH_MSB_IC_1_MASK 0xFF
#define R234_PROG_CNTR_MAXLENGTH0_PROG_MAXLENGTH_MSB_IC_1_SHIFT 0

/* PROG_CNTR_MAXLENGTH1 (IC 1) */
#define R235_PROG_CNTR_MAXLENGTH1_PROG_MAXLENGTH_LSB_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R235_PROG_CNTR_MAXLENGTH1_PROG_MAXLENGTH_LSB_IC_1_MASK 0xFFFF
#define R235_PROG_CNTR_MAXLENGTH1_PROG_MAXLENGTH_LSB_IC_1_SHIFT 0

/* PANIC_PARITY_MASK1 (IC 1) */
#define R236_PANIC_PARITY_MASK1_DM0_BANK0_SUBBANK0_MASK_IC_1 0x0 /* 0b	[0] */
#define R236_PANIC_PARITY_MASK1_DM0_BANK0_SUBBANK1_MASK_IC_1 0x0 /* 0b	[1] */
#define R236_PANIC_PARITY_MASK1_DM0_BANK0_SUBBANK2_MASK_IC_1 0x0 /* 0b	[2] */
#define R236_PANIC_PARITY_MASK1_DM0_BANK0_SUBBANK3_MASK_IC_1 0x0 /* 0b	[3] */
#define R236_PANIC_PARITY_MASK1_DM0_BANK0_SUBBANK4_MASK_IC_1 0x0 /* 0b	[4] */
#define R236_PANIC_PARITY_MASK1_DM0_BANK1_SUBBANK0_MASK_IC_1 0x0 /* 0b	[8] */
#define R236_PANIC_PARITY_MASK1_DM0_BANK1_SUBBANK1_MASK_IC_1 0x0 /* 0b	[9] */
#define R236_PANIC_PARITY_MASK1_DM0_BANK1_SUBBANK2_MASK_IC_1 0x0 /* 0b	[10] */
#define R236_PANIC_PARITY_MASK1_DM0_BANK1_SUBBANK3_MASK_IC_1 0x0 /* 0b	[11] */
#define R236_PANIC_PARITY_MASK1_DM0_BANK1_SUBBANK4_MASK_IC_1 0x0 /* 0b	[12] */
#define R236_PANIC_PARITY_MASK1_DM0_BANK0_SUBBANK0_MASK_IC_1_MASK 0x1
#define R236_PANIC_PARITY_MASK1_DM0_BANK0_SUBBANK0_MASK_IC_1_SHIFT 0
#define R236_PANIC_PARITY_MASK1_DM0_BANK0_SUBBANK1_MASK_IC_1_MASK 0x2
#define R236_PANIC_PARITY_MASK1_DM0_BANK0_SUBBANK1_MASK_IC_1_SHIFT 1
#define R236_PANIC_PARITY_MASK1_DM0_BANK0_SUBBANK2_MASK_IC_1_MASK 0x4
#define R236_PANIC_PARITY_MASK1_DM0_BANK0_SUBBANK2_MASK_IC_1_SHIFT 2
#define R236_PANIC_PARITY_MASK1_DM0_BANK0_SUBBANK3_MASK_IC_1_MASK 0x8
#define R236_PANIC_PARITY_MASK1_DM0_BANK0_SUBBANK3_MASK_IC_1_SHIFT 3
#define R236_PANIC_PARITY_MASK1_DM0_BANK0_SUBBANK4_MASK_IC_1_MASK 0x10
#define R236_PANIC_PARITY_MASK1_DM0_BANK0_SUBBANK4_MASK_IC_1_SHIFT 4
#define R236_PANIC_PARITY_MASK1_DM0_BANK1_SUBBANK0_MASK_IC_1_MASK 0x100
#define R236_PANIC_PARITY_MASK1_DM0_BANK1_SUBBANK0_MASK_IC_1_SHIFT 8
#define R236_PANIC_PARITY_MASK1_DM0_BANK1_SUBBANK1_MASK_IC_1_MASK 0x200
#define R236_PANIC_PARITY_MASK1_DM0_BANK1_SUBBANK1_MASK_IC_1_SHIFT 9
#define R236_PANIC_PARITY_MASK1_DM0_BANK1_SUBBANK2_MASK_IC_1_MASK 0x400
#define R236_PANIC_PARITY_MASK1_DM0_BANK1_SUBBANK2_MASK_IC_1_SHIFT 10
#define R236_PANIC_PARITY_MASK1_DM0_BANK1_SUBBANK3_MASK_IC_1_MASK 0x800
#define R236_PANIC_PARITY_MASK1_DM0_BANK1_SUBBANK3_MASK_IC_1_SHIFT 11
#define R236_PANIC_PARITY_MASK1_DM0_BANK1_SUBBANK4_MASK_IC_1_MASK 0x1000
#define R236_PANIC_PARITY_MASK1_DM0_BANK1_SUBBANK4_MASK_IC_1_SHIFT 12

/* PANIC_PARITY_MASK2 (IC 1) */
#define R237_PANIC_PARITY_MASK2_DM0_BANK2_SUBBANK0_MASK_IC_1 0x0 /* 0b	[0] */
#define R237_PANIC_PARITY_MASK2_DM0_BANK2_SUBBANK1_MASK_IC_1 0x0 /* 0b	[1] */
#define R237_PANIC_PARITY_MASK2_DM0_BANK2_SUBBANK2_MASK_IC_1 0x0 /* 0b	[2] */
#define R237_PANIC_PARITY_MASK2_DM0_BANK2_SUBBANK3_MASK_IC_1 0x0 /* 0b	[3] */
#define R237_PANIC_PARITY_MASK2_DM0_BANK2_SUBBANK4_MASK_IC_1 0x0 /* 0b	[4] */
#define R237_PANIC_PARITY_MASK2_DM0_BANK3_SUBBANK0_MASK_IC_1 0x0 /* 0b	[8] */
#define R237_PANIC_PARITY_MASK2_DM0_BANK3_SUBBANK1_MASK_IC_1 0x0 /* 0b	[9] */
#define R237_PANIC_PARITY_MASK2_DM0_BANK3_SUBBANK2_MASK_IC_1 0x0 /* 0b	[10] */
#define R237_PANIC_PARITY_MASK2_DM0_BANK3_SUBBANK3_MASK_IC_1 0x0 /* 0b	[11] */
#define R237_PANIC_PARITY_MASK2_DM0_BANK3_SUBBANK4_MASK_IC_1 0x0 /* 0b	[12] */
#define R237_PANIC_PARITY_MASK2_DM0_BANK2_SUBBANK0_MASK_IC_1_MASK 0x1
#define R237_PANIC_PARITY_MASK2_DM0_BANK2_SUBBANK0_MASK_IC_1_SHIFT 0
#define R237_PANIC_PARITY_MASK2_DM0_BANK2_SUBBANK1_MASK_IC_1_MASK 0x2
#define R237_PANIC_PARITY_MASK2_DM0_BANK2_SUBBANK1_MASK_IC_1_SHIFT 1
#define R237_PANIC_PARITY_MASK2_DM0_BANK2_SUBBANK2_MASK_IC_1_MASK 0x4
#define R237_PANIC_PARITY_MASK2_DM0_BANK2_SUBBANK2_MASK_IC_1_SHIFT 2
#define R237_PANIC_PARITY_MASK2_DM0_BANK2_SUBBANK3_MASK_IC_1_MASK 0x8
#define R237_PANIC_PARITY_MASK2_DM0_BANK2_SUBBANK3_MASK_IC_1_SHIFT 3
#define R237_PANIC_PARITY_MASK2_DM0_BANK2_SUBBANK4_MASK_IC_1_MASK 0x10
#define R237_PANIC_PARITY_MASK2_DM0_BANK2_SUBBANK4_MASK_IC_1_SHIFT 4
#define R237_PANIC_PARITY_MASK2_DM0_BANK3_SUBBANK0_MASK_IC_1_MASK 0x100
#define R237_PANIC_PARITY_MASK2_DM0_BANK3_SUBBANK0_MASK_IC_1_SHIFT 8
#define R237_PANIC_PARITY_MASK2_DM0_BANK3_SUBBANK1_MASK_IC_1_MASK 0x200
#define R237_PANIC_PARITY_MASK2_DM0_BANK3_SUBBANK1_MASK_IC_1_SHIFT 9
#define R237_PANIC_PARITY_MASK2_DM0_BANK3_SUBBANK2_MASK_IC_1_MASK 0x400
#define R237_PANIC_PARITY_MASK2_DM0_BANK3_SUBBANK2_MASK_IC_1_SHIFT 10
#define R237_PANIC_PARITY_MASK2_DM0_BANK3_SUBBANK3_MASK_IC_1_MASK 0x800
#define R237_PANIC_PARITY_MASK2_DM0_BANK3_SUBBANK3_MASK_IC_1_SHIFT 11
#define R237_PANIC_PARITY_MASK2_DM0_BANK3_SUBBANK4_MASK_IC_1_MASK 0x1000
#define R237_PANIC_PARITY_MASK2_DM0_BANK3_SUBBANK4_MASK_IC_1_SHIFT 12

/* PANIC_PARITY_MASK3 (IC 1) */
#define R238_PANIC_PARITY_MASK3_DM1_BANK0_SUBBANK0_MASK_IC_1 0x0 /* 0b	[0] */
#define R238_PANIC_PARITY_MASK3_DM1_BANK0_SUBBANK1_MASK_IC_1 0x0 /* 0b	[1] */
#define R238_PANIC_PARITY_MASK3_DM1_BANK0_SUBBANK2_MASK_IC_1 0x0 /* 0b	[2] */
#define R238_PANIC_PARITY_MASK3_DM1_BANK0_SUBBANK3_MASK_IC_1 0x0 /* 0b	[3] */
#define R238_PANIC_PARITY_MASK3_DM1_BANK0_SUBBANK4_MASK_IC_1 0x0 /* 0b	[4] */
#define R238_PANIC_PARITY_MASK3_DM1_BANK1_SUBBANK0_MASK_IC_1 0x0 /* 0b	[8] */
#define R238_PANIC_PARITY_MASK3_DM1_BANK1_SUBBANK1_MASK_IC_1 0x0 /* 0b	[9] */
#define R238_PANIC_PARITY_MASK3_DM1_BANK1_SUBBANK2_MASK_IC_1 0x0 /* 0b	[10] */
#define R238_PANIC_PARITY_MASK3_DM1_BANK1_SUBBANK3_MASK_IC_1 0x0 /* 0b	[11] */
#define R238_PANIC_PARITY_MASK3_DM1_BANK1_SUBBANK4_MASK_IC_1 0x0 /* 0b	[12] */
#define R238_PANIC_PARITY_MASK3_DM1_BANK0_SUBBANK0_MASK_IC_1_MASK 0x1
#define R238_PANIC_PARITY_MASK3_DM1_BANK0_SUBBANK0_MASK_IC_1_SHIFT 0
#define R238_PANIC_PARITY_MASK3_DM1_BANK0_SUBBANK1_MASK_IC_1_MASK 0x2
#define R238_PANIC_PARITY_MASK3_DM1_BANK0_SUBBANK1_MASK_IC_1_SHIFT 1
#define R238_PANIC_PARITY_MASK3_DM1_BANK0_SUBBANK2_MASK_IC_1_MASK 0x4
#define R238_PANIC_PARITY_MASK3_DM1_BANK0_SUBBANK2_MASK_IC_1_SHIFT 2
#define R238_PANIC_PARITY_MASK3_DM1_BANK0_SUBBANK3_MASK_IC_1_MASK 0x8
#define R238_PANIC_PARITY_MASK3_DM1_BANK0_SUBBANK3_MASK_IC_1_SHIFT 3
#define R238_PANIC_PARITY_MASK3_DM1_BANK0_SUBBANK4_MASK_IC_1_MASK 0x10
#define R238_PANIC_PARITY_MASK3_DM1_BANK0_SUBBANK4_MASK_IC_1_SHIFT 4
#define R238_PANIC_PARITY_MASK3_DM1_BANK1_SUBBANK0_MASK_IC_1_MASK 0x100
#define R238_PANIC_PARITY_MASK3_DM1_BANK1_SUBBANK0_MASK_IC_1_SHIFT 8
#define R238_PANIC_PARITY_MASK3_DM1_BANK1_SUBBANK1_MASK_IC_1_MASK 0x200
#define R238_PANIC_PARITY_MASK3_DM1_BANK1_SUBBANK1_MASK_IC_1_SHIFT 9
#define R238_PANIC_PARITY_MASK3_DM1_BANK1_SUBBANK2_MASK_IC_1_MASK 0x400
#define R238_PANIC_PARITY_MASK3_DM1_BANK1_SUBBANK2_MASK_IC_1_SHIFT 10
#define R238_PANIC_PARITY_MASK3_DM1_BANK1_SUBBANK3_MASK_IC_1_MASK 0x800
#define R238_PANIC_PARITY_MASK3_DM1_BANK1_SUBBANK3_MASK_IC_1_SHIFT 11
#define R238_PANIC_PARITY_MASK3_DM1_BANK1_SUBBANK4_MASK_IC_1_MASK 0x1000
#define R238_PANIC_PARITY_MASK3_DM1_BANK1_SUBBANK4_MASK_IC_1_SHIFT 12

/* PANIC_PARITY_MASK4 (IC 1) */
#define R239_PANIC_PARITY_MASK4_DM1_BANK2_SUBBANK0_MASK_IC_1 0x0 /* 0b	[0] */
#define R239_PANIC_PARITY_MASK4_DM1_BANK2_SUBBANK1_MASK_IC_1 0x0 /* 0b	[1] */
#define R239_PANIC_PARITY_MASK4_DM1_BANK2_SUBBANK2_MASK_IC_1 0x0 /* 0b	[2] */
#define R239_PANIC_PARITY_MASK4_DM1_BANK2_SUBBANK3_MASK_IC_1 0x0 /* 0b	[3] */
#define R239_PANIC_PARITY_MASK4_DM1_BANK2_SUBBANK4_MASK_IC_1 0x0 /* 0b	[4] */
#define R239_PANIC_PARITY_MASK4_DM1_BANK3_SUBBANK0_MASK_IC_1 0x0 /* 0b	[8] */
#define R239_PANIC_PARITY_MASK4_DM1_BANK3_SUBBANK1_MASK_IC_1 0x0 /* 0b	[9] */
#define R239_PANIC_PARITY_MASK4_DM1_BANK3_SUBBANK2_MASK_IC_1 0x0 /* 0b	[10] */
#define R239_PANIC_PARITY_MASK4_DM1_BANK3_SUBBANK3_MASK_IC_1 0x0 /* 0b	[11] */
#define R239_PANIC_PARITY_MASK4_DM1_BANK3_SUBBANK4_MASK_IC_1 0x0 /* 0b	[12] */
#define R239_PANIC_PARITY_MASK4_DM1_BANK2_SUBBANK0_MASK_IC_1_MASK 0x1
#define R239_PANIC_PARITY_MASK4_DM1_BANK2_SUBBANK0_MASK_IC_1_SHIFT 0
#define R239_PANIC_PARITY_MASK4_DM1_BANK2_SUBBANK1_MASK_IC_1_MASK 0x2
#define R239_PANIC_PARITY_MASK4_DM1_BANK2_SUBBANK1_MASK_IC_1_SHIFT 1
#define R239_PANIC_PARITY_MASK4_DM1_BANK2_SUBBANK2_MASK_IC_1_MASK 0x4
#define R239_PANIC_PARITY_MASK4_DM1_BANK2_SUBBANK2_MASK_IC_1_SHIFT 2
#define R239_PANIC_PARITY_MASK4_DM1_BANK2_SUBBANK3_MASK_IC_1_MASK 0x8
#define R239_PANIC_PARITY_MASK4_DM1_BANK2_SUBBANK3_MASK_IC_1_SHIFT 3
#define R239_PANIC_PARITY_MASK4_DM1_BANK2_SUBBANK4_MASK_IC_1_MASK 0x10
#define R239_PANIC_PARITY_MASK4_DM1_BANK2_SUBBANK4_MASK_IC_1_SHIFT 4
#define R239_PANIC_PARITY_MASK4_DM1_BANK3_SUBBANK0_MASK_IC_1_MASK 0x100
#define R239_PANIC_PARITY_MASK4_DM1_BANK3_SUBBANK0_MASK_IC_1_SHIFT 8
#define R239_PANIC_PARITY_MASK4_DM1_BANK3_SUBBANK1_MASK_IC_1_MASK 0x200
#define R239_PANIC_PARITY_MASK4_DM1_BANK3_SUBBANK1_MASK_IC_1_SHIFT 9
#define R239_PANIC_PARITY_MASK4_DM1_BANK3_SUBBANK2_MASK_IC_1_MASK 0x400
#define R239_PANIC_PARITY_MASK4_DM1_BANK3_SUBBANK2_MASK_IC_1_SHIFT 10
#define R239_PANIC_PARITY_MASK4_DM1_BANK3_SUBBANK3_MASK_IC_1_MASK 0x800
#define R239_PANIC_PARITY_MASK4_DM1_BANK3_SUBBANK3_MASK_IC_1_SHIFT 11
#define R239_PANIC_PARITY_MASK4_DM1_BANK3_SUBBANK4_MASK_IC_1_MASK 0x1000
#define R239_PANIC_PARITY_MASK4_DM1_BANK3_SUBBANK4_MASK_IC_1_SHIFT 12

/* PANIC_PARITY_MASK5 (IC 1) */
#define R240_PANIC_PARITY_MASK5_PM_BANK0_SUBBANK0_MASK_IC_1 0x0 /* 0b	[0] */
#define R240_PANIC_PARITY_MASK5_PM_BANK0_SUBBANK1_MASK_IC_1 0x0 /* 0b	[1] */
#define R240_PANIC_PARITY_MASK5_PM_BANK0_SUBBANK2_MASK_IC_1 0x0 /* 0b	[2] */
#define R240_PANIC_PARITY_MASK5_PM_BANK0_SUBBANK3_MASK_IC_1 0x0 /* 0b	[3] */
#define R240_PANIC_PARITY_MASK5_PM_BANK0_SUBBANK4_MASK_IC_1 0x0 /* 0b	[4] */
#define R240_PANIC_PARITY_MASK5_PM_BANK0_SUBBANK5_MASK_IC_1 0x0 /* 0b	[5] */
#define R240_PANIC_PARITY_MASK5_PM_BANK1_SUBBANK0_MASK_IC_1 0x0 /* 0b	[8] */
#define R240_PANIC_PARITY_MASK5_PM_BANK1_SUBBANK1_MASK_IC_1 0x0 /* 0b	[9] */
#define R240_PANIC_PARITY_MASK5_PM_BANK1_SUBBANK2_MASK_IC_1 0x0 /* 0b	[10] */
#define R240_PANIC_PARITY_MASK5_PM_BANK1_SUBBANK3_MASK_IC_1 0x0 /* 0b	[11] */
#define R240_PANIC_PARITY_MASK5_PM_BANK1_SUBBANK4_MASK_IC_1 0x0 /* 0b	[12] */
#define R240_PANIC_PARITY_MASK5_PM_BANK1_SUBBANK5_MASK_IC_1 0x0 /* 0b	[13] */
#define R240_PANIC_PARITY_MASK5_PM_BANK0_SUBBANK0_MASK_IC_1_MASK 0x1
#define R240_PANIC_PARITY_MASK5_PM_BANK0_SUBBANK0_MASK_IC_1_SHIFT 0
#define R240_PANIC_PARITY_MASK5_PM_BANK0_SUBBANK1_MASK_IC_1_MASK 0x2
#define R240_PANIC_PARITY_MASK5_PM_BANK0_SUBBANK1_MASK_IC_1_SHIFT 1
#define R240_PANIC_PARITY_MASK5_PM_BANK0_SUBBANK2_MASK_IC_1_MASK 0x4
#define R240_PANIC_PARITY_MASK5_PM_BANK0_SUBBANK2_MASK_IC_1_SHIFT 2
#define R240_PANIC_PARITY_MASK5_PM_BANK0_SUBBANK3_MASK_IC_1_MASK 0x8
#define R240_PANIC_PARITY_MASK5_PM_BANK0_SUBBANK3_MASK_IC_1_SHIFT 3
#define R240_PANIC_PARITY_MASK5_PM_BANK0_SUBBANK4_MASK_IC_1_MASK 0x10
#define R240_PANIC_PARITY_MASK5_PM_BANK0_SUBBANK4_MASK_IC_1_SHIFT 4
#define R240_PANIC_PARITY_MASK5_PM_BANK0_SUBBANK5_MASK_IC_1_MASK 0x20
#define R240_PANIC_PARITY_MASK5_PM_BANK0_SUBBANK5_MASK_IC_1_SHIFT 5
#define R240_PANIC_PARITY_MASK5_PM_BANK1_SUBBANK0_MASK_IC_1_MASK 0x100
#define R240_PANIC_PARITY_MASK5_PM_BANK1_SUBBANK0_MASK_IC_1_SHIFT 8
#define R240_PANIC_PARITY_MASK5_PM_BANK1_SUBBANK1_MASK_IC_1_MASK 0x200
#define R240_PANIC_PARITY_MASK5_PM_BANK1_SUBBANK1_MASK_IC_1_SHIFT 9
#define R240_PANIC_PARITY_MASK5_PM_BANK1_SUBBANK2_MASK_IC_1_MASK 0x400
#define R240_PANIC_PARITY_MASK5_PM_BANK1_SUBBANK2_MASK_IC_1_SHIFT 10
#define R240_PANIC_PARITY_MASK5_PM_BANK1_SUBBANK3_MASK_IC_1_MASK 0x800
#define R240_PANIC_PARITY_MASK5_PM_BANK1_SUBBANK3_MASK_IC_1_SHIFT 11
#define R240_PANIC_PARITY_MASK5_PM_BANK1_SUBBANK4_MASK_IC_1_MASK 0x1000
#define R240_PANIC_PARITY_MASK5_PM_BANK1_SUBBANK4_MASK_IC_1_SHIFT 12
#define R240_PANIC_PARITY_MASK5_PM_BANK1_SUBBANK5_MASK_IC_1_MASK 0x2000
#define R240_PANIC_PARITY_MASK5_PM_BANK1_SUBBANK5_MASK_IC_1_SHIFT 13

/* PANIC_CODE1 (IC 1) */
#define R241_PANIC_CODE1_ERR_DM0B0SB0_IC_1        0x0    /* 0b	[0] */
#define R241_PANIC_CODE1_ERR_DM0B0SB1_IC_1        0x0    /* 0b	[1] */
#define R241_PANIC_CODE1_ERR_DM0B0SB2_IC_1        0x0    /* 0b	[2] */
#define R241_PANIC_CODE1_ERR_DM0B0SB3_IC_1        0x0    /* 0b	[3] */
#define R241_PANIC_CODE1_ERR_DM0B0SB4_IC_1        0x0    /* 0b	[4] */
#define R241_PANIC_CODE1_ERR_DM0B1SB0_IC_1        0x0    /* 0b	[8] */
#define R241_PANIC_CODE1_ERR_DM0B1SB1_IC_1        0x0    /* 0b	[9] */
#define R241_PANIC_CODE1_ERR_DM0B1SB2_IC_1        0x0    /* 0b	[10] */
#define R241_PANIC_CODE1_ERR_DM0B1SB3_IC_1        0x0    /* 0b	[11] */
#define R241_PANIC_CODE1_ERR_DM0B1SB4_IC_1        0x0    /* 0b	[12] */
#define R241_PANIC_CODE1_ERR_DM0B0SB0_IC_1_MASK   0x1
#define R241_PANIC_CODE1_ERR_DM0B0SB0_IC_1_SHIFT  0
#define R241_PANIC_CODE1_ERR_DM0B0SB1_IC_1_MASK   0x2
#define R241_PANIC_CODE1_ERR_DM0B0SB1_IC_1_SHIFT  1
#define R241_PANIC_CODE1_ERR_DM0B0SB2_IC_1_MASK   0x4
#define R241_PANIC_CODE1_ERR_DM0B0SB2_IC_1_SHIFT  2
#define R241_PANIC_CODE1_ERR_DM0B0SB3_IC_1_MASK   0x8
#define R241_PANIC_CODE1_ERR_DM0B0SB3_IC_1_SHIFT  3
#define R241_PANIC_CODE1_ERR_DM0B0SB4_IC_1_MASK   0x10
#define R241_PANIC_CODE1_ERR_DM0B0SB4_IC_1_SHIFT  4
#define R241_PANIC_CODE1_ERR_DM0B1SB0_IC_1_MASK   0x100
#define R241_PANIC_CODE1_ERR_DM0B1SB0_IC_1_SHIFT  8
#define R241_PANIC_CODE1_ERR_DM0B1SB1_IC_1_MASK   0x200
#define R241_PANIC_CODE1_ERR_DM0B1SB1_IC_1_SHIFT  9
#define R241_PANIC_CODE1_ERR_DM0B1SB2_IC_1_MASK   0x400
#define R241_PANIC_CODE1_ERR_DM0B1SB2_IC_1_SHIFT  10
#define R241_PANIC_CODE1_ERR_DM0B1SB3_IC_1_MASK   0x800
#define R241_PANIC_CODE1_ERR_DM0B1SB3_IC_1_SHIFT  11
#define R241_PANIC_CODE1_ERR_DM0B1SB4_IC_1_MASK   0x1000
#define R241_PANIC_CODE1_ERR_DM0B1SB4_IC_1_SHIFT  12

