LeanderGlanda/endstufe-esp32/src/sigmastudio/systemfiles_IC_1_REG.h
/* MP13_READ (IC 1) */
#define R287_MP13_READ_MP_REG_READ_IC_1           0x0    /* 0b	[0] */
#define R287_MP13_READ_MP_REG_READ_IC_1_MASK      0x1
#define R287_MP13_READ_MP_REG_READ_IC_1_SHIFT     0

/* DMIC_CTRL0 (IC 1) */
#define R288_DMIC_CTRL0_DMIC_EN_IC_1              0x0    /* 0b	[0] */
#define R288_DMIC_CTRL0_DMSW_IC_1                 0x0    /* 0b	[1] */
#define R288_DMIC_CTRL0_DMPOL_IC_1                0x0    /* 0b	[2] */
#define R288_DMIC_CTRL0_HPF_IC_1                  0x0    /* 0b	[3] */
#define R288_DMIC_CTRL0_DMIC_CLK_IC_1             0x0    /* 000b	[6:4] */
#define R288_DMIC_CTRL0_MIC_DATA_SRC_IC_1         0x0    /* 0000b	[11:8] */
#define R288_DMIC_CTRL0_CUTOFF_IC_1               0x4    /* 100b	[14:12] */
#define R288_DMIC_CTRL0_DMIC_EN_IC_1_MASK         0x1
#define R288_DMIC_CTRL0_DMIC_EN_IC_1_SHIFT        0
#define R288_DMIC_CTRL0_DMSW_IC_1_MASK            0x2
#define R288_DMIC_CTRL0_DMSW_IC_1_SHIFT           1
#define R288_DMIC_CTRL0_DMPOL_IC_1_MASK           0x4
#define R288_DMIC_CTRL0_DMPOL_IC_1_SHIFT          2
#define R288_DMIC_CTRL0_HPF_IC_1_MASK             0x8
#define R288_DMIC_CTRL0_HPF_IC_1_SHIFT            3
#define R288_DMIC_CTRL0_DMIC_CLK_IC_1_MASK        0x70
#define R288_DMIC_CTRL0_DMIC_CLK_IC_1_SHIFT       4
#define R288_DMIC_CTRL0_MIC_DATA_SRC_IC_1_MASK    0xF00
#define R288_DMIC_CTRL0_MIC_DATA_SRC_IC_1_SHIFT   8
#define R288_DMIC_CTRL0_CUTOFF_IC_1_MASK          0x7000
#define R288_DMIC_CTRL0_CUTOFF_IC_1_SHIFT         12

/* DMIC_CTRL1 (IC 1) */
#define R289_DMIC_CTRL1_DMIC_EN_IC_1              0x0    /* 0b	[0] */
#define R289_DMIC_CTRL1_DMSW_IC_1                 0x0    /* 0b	[1] */
#define R289_DMIC_CTRL1_DMPOL_IC_1                0x0    /* 0b	[2] */
#define R289_DMIC_CTRL1_HPF_IC_1                  0x0    /* 0b	[3] */
#define R289_DMIC_CTRL1_DMIC_CLK_IC_1             0x0    /* 000b	[6:4] */
#define R289_DMIC_CTRL1_MIC_DATA_SRC_IC_1         0x0    /* 0000b	[11:8] */
#define R289_DMIC_CTRL1_CUTOFF_IC_1               0x4    /* 100b	[14:12] */
#define R289_DMIC_CTRL1_DMIC_EN_IC_1_MASK         0x1
#define R289_DMIC_CTRL1_DMIC_EN_IC_1_SHIFT        0
#define R289_DMIC_CTRL1_DMSW_IC_1_MASK            0x2
#define R289_DMIC_CTRL1_DMSW_IC_1_SHIFT           1
#define R289_DMIC_CTRL1_DMPOL_IC_1_MASK           0x4
#define R289_DMIC_CTRL1_DMPOL_IC_1_SHIFT          2
#define R289_DMIC_CTRL1_HPF_IC_1_MASK             0x8
#define R289_DMIC_CTRL1_HPF_IC_1_SHIFT            3
#define R289_DMIC_CTRL1_DMIC_CLK_IC_1_MASK        0x70
#define R289_DMIC_CTRL1_DMIC_CLK_IC_1_SHIFT       4
#define R289_DMIC_CTRL1_MIC_DATA_SRC_IC_1_MASK    0xF00
#define R289_DMIC_CTRL1_MIC_DATA_SRC_IC_1_SHIFT   8
#define R289_DMIC_CTRL1_CUTOFF_IC_1_MASK          0x7000
#define R289_DMIC_CTRL1_CUTOFF_IC_1_SHIFT         12

/* ASRC_LOCK (IC 1) */
#define R290_ASRC_LOCK_ASRC0L_IC_1                0x0    /* 0b	[0] */
#define R290_ASRC_LOCK_ASRC1L_IC_1                0x0    /* 0b	[1] */
#define R290_ASRC_LOCK_ASRC2L_IC_1                0x0    /* 0b	[2] */
#define R290_ASRC_LOCK_ASRC3L_IC_1                0x0    /* 0b	[3] */
#define R290_ASRC_LOCK_ASRC4L_IC_1                0x0    /* 0b	[4] */
#define R290_ASRC_LOCK_ASRC5L_IC_1                0x0    /* 0b	[5] */
#define R290_ASRC_LOCK_ASRC6L_IC_1                0x0    /* 0b	[6] */
#define R290_ASRC_LOCK_ASRC7L_IC_1                0x0    /* 0b	[7] */
#define R290_ASRC_LOCK_ASRC0L_IC_1_MASK           0x1
#define R290_ASRC_LOCK_ASRC0L_IC_1_SHIFT          0
#define R290_ASRC_LOCK_ASRC1L_IC_1_MASK           0x2
#define R290_ASRC_LOCK_ASRC1L_IC_1_SHIFT          1
#define R290_ASRC_LOCK_ASRC2L_IC_1_MASK           0x4
#define R290_ASRC_LOCK_ASRC2L_IC_1_SHIFT          2
#define R290_ASRC_LOCK_ASRC3L_IC_1_MASK           0x8
#define R290_ASRC_LOCK_ASRC3L_IC_1_SHIFT          3
#define R290_ASRC_LOCK_ASRC4L_IC_1_MASK           0x10
#define R290_ASRC_LOCK_ASRC4L_IC_1_SHIFT          4
#define R290_ASRC_LOCK_ASRC5L_IC_1_MASK           0x20
#define R290_ASRC_LOCK_ASRC5L_IC_1_SHIFT          5
#define R290_ASRC_LOCK_ASRC6L_IC_1_MASK           0x40
#define R290_ASRC_LOCK_ASRC6L_IC_1_SHIFT          6
#define R290_ASRC_LOCK_ASRC7L_IC_1_MASK           0x80
#define R290_ASRC_LOCK_ASRC7L_IC_1_SHIFT          7

/* ASRC_MUTE (IC 1) */
#define R291_ASRC_MUTE_ASRC0M_IC_1                0x0    /* 0b	[0] */
#define R291_ASRC_MUTE_ASRC1M_IC_1                0x0    /* 0b	[1] */
#define R291_ASRC_MUTE_ASRC2M_IC_1                0x0    /* 0b	[2] */
#define R291_ASRC_MUTE_ASRC3M_IC_1                0x0    /* 0b	[3] */
#define R291_ASRC_MUTE_ASRC4M_IC_1                0x0    /* 0b	[4] */
#define R291_ASRC_MUTE_ASRC5M_IC_1                0x0    /* 0b	[5] */
#define R291_ASRC_MUTE_ASRC6M_IC_1                0x0    /* 0b	[6] */
#define R291_ASRC_MUTE_ASRC7M_IC_1                0x0    /* 0b	[7] */
#define R291_ASRC_MUTE_ASRC_RAMP0_IC_1            0x0    /* 0b	[8] */
#define R291_ASRC_MUTE_ASRC_RAMP1_IC_1            0x0    /* 0b	[9] */
#define R291_ASRC_MUTE_LOCKMUTE_IC_1              0x0    /* 0b	[10] */
#define R291_ASRC_MUTE_ASRC0M_IC_1_MASK           0x1
#define R291_ASRC_MUTE_ASRC0M_IC_1_SHIFT          0
#define R291_ASRC_MUTE_ASRC1M_IC_1_MASK           0x2
#define R291_ASRC_MUTE_ASRC1M_IC_1_SHIFT          1
#define R291_ASRC_MUTE_ASRC2M_IC_1_MASK           0x4
#define R291_ASRC_MUTE_ASRC2M_IC_1_SHIFT          2
#define R291_ASRC_MUTE_ASRC3M_IC_1_MASK           0x8
#define R291_ASRC_MUTE_ASRC3M_IC_1_SHIFT          3
#define R291_ASRC_MUTE_ASRC4M_IC_1_MASK           0x10
#define R291_ASRC_MUTE_ASRC4M_IC_1_SHIFT          4
#define R291_ASRC_MUTE_ASRC5M_IC_1_MASK           0x20
#define R291_ASRC_MUTE_ASRC5M_IC_1_SHIFT          5
#define R291_ASRC_MUTE_ASRC6M_IC_1_MASK           0x40
#define R291_ASRC_MUTE_ASRC6M_IC_1_SHIFT          6
#define R291_ASRC_MUTE_ASRC7M_IC_1_MASK           0x80
#define R291_ASRC_MUTE_ASRC7M_IC_1_SHIFT          7
#define R291_ASRC_MUTE_ASRC_RAMP0_IC_1_MASK       0x100
#define R291_ASRC_MUTE_ASRC_RAMP0_IC_1_SHIFT      8
#define R291_ASRC_MUTE_ASRC_RAMP1_IC_1_MASK       0x200
#define R291_ASRC_MUTE_ASRC_RAMP1_IC_1_SHIFT      9
#define R291_ASRC_MUTE_LOCKMUTE_IC_1_MASK         0x400
#define R291_ASRC_MUTE_LOCKMUTE_IC_1_SHIFT        10

/* ASRC0_RATIO (IC 1) */
#define R292_ASRC0_RATIO_ASRC_RATIO_IC_1          0x0000 /* 0000000000000000b	[15:0] */
#define R292_ASRC0_RATIO_ASRC_RATIO_IC_1_MASK     0xFFFF
#define R292_ASRC0_RATIO_ASRC_RATIO_IC_1_SHIFT    0

/* ASRC1_RATIO (IC 1) */
#define R293_ASRC1_RATIO_ASRC_RATIO_IC_1          0x0000 /* 0000000000000000b	[15:0] */
#define R293_ASRC1_RATIO_ASRC_RATIO_IC_1_MASK     0xFFFF
#define R293_ASRC1_RATIO_ASRC_RATIO_IC_1_SHIFT    0

/* ASRC2_RATIO (IC 1) */
#define R294_ASRC2_RATIO_ASRC_RATIO_IC_1          0x0000 /* 0000000000000000b	[15:0] */
#define R294_ASRC2_RATIO_ASRC_RATIO_IC_1_MASK     0xFFFF
#define R294_ASRC2_RATIO_ASRC_RATIO_IC_1_SHIFT    0

/* ASRC3_RATIO (IC 1) */
#define R295_ASRC3_RATIO_ASRC_RATIO_IC_1          0x0000 /* 0000000000000000b	[15:0] */
#define R295_ASRC3_RATIO_ASRC_RATIO_IC_1_MASK     0xFFFF
#define R295_ASRC3_RATIO_ASRC_RATIO_IC_1_SHIFT    0

/* ASRC4_RATIO (IC 1) */
#define R296_ASRC4_RATIO_ASRC_RATIO_IC_1          0x0000 /* 0000000000000000b	[15:0] */
#define R296_ASRC4_RATIO_ASRC_RATIO_IC_1_MASK     0xFFFF
#define R296_ASRC4_RATIO_ASRC_RATIO_IC_1_SHIFT    0

/* ASRC5_RATIO (IC 1) */
#define R297_ASRC5_RATIO_ASRC_RATIO_IC_1          0x0000 /* 0000000000000000b	[15:0] */
#define R297_ASRC5_RATIO_ASRC_RATIO_IC_1_MASK     0xFFFF
#define R297_ASRC5_RATIO_ASRC_RATIO_IC_1_SHIFT    0

/* ASRC6_RATIO (IC 1) */
#define R298_ASRC6_RATIO_ASRC_RATIO_IC_1          0x0000 /* 0000000000000000b	[15:0] */
#define R298_ASRC6_RATIO_ASRC_RATIO_IC_1_MASK     0xFFFF
#define R298_ASRC6_RATIO_ASRC_RATIO_IC_1_SHIFT    0

/* ASRC7_RATIO (IC 1) */
#define R299_ASRC7_RATIO_ASRC_RATIO_IC_1          0x0000 /* 0000000000000000b	[15:0] */
#define R299_ASRC7_RATIO_ASRC_RATIO_IC_1_MASK     0xFFFF
#define R299_ASRC7_RATIO_ASRC_RATIO_IC_1_SHIFT    0

/* ASRC_RAMPMAX_OVR (IC 1) */
#define R300_ASRC_RAMPMAX_OVR_OVR_RAMPMAX_VALUE_IC_1 0x7FF /* 11111111111b	[10:0] */
#define R300_ASRC_RAMPMAX_OVR_OVERRIDE_IC_1       0x0    /* 0b	[11] */
#define R300_ASRC_RAMPMAX_OVR_OVR_RAMPMAX_VALUE_IC_1_MASK 0x7FF
#define R300_ASRC_RAMPMAX_OVR_OVR_RAMPMAX_VALUE_IC_1_SHIFT 0
#define R300_ASRC_RAMPMAX_OVR_OVERRIDE_IC_1_MASK  0x800
#define R300_ASRC_RAMPMAX_OVR_OVERRIDE_IC_1_SHIFT 11

/* ASRC0_RAMPMAX (IC 1) */
#define R301_ASRC0_RAMPMAX_RAMPMAX_VALUE_IC_1     0x7FF  /* 11111111111b	[10:0] */
#define R301_ASRC0_RAMPMAX_RAMPMAX_VALUE_IC_1_MASK 0x7FF
#define R301_ASRC0_RAMPMAX_RAMPMAX_VALUE_IC_1_SHIFT 0

/* ASRC1_RAMPMAX (IC 1) */
#define R302_ASRC1_RAMPMAX_RAMPMAX_VALUE_IC_1     0x7FF  /* 11111111111b	[10:0] */
#define R302_ASRC1_RAMPMAX_RAMPMAX_VALUE_IC_1_MASK 0x7FF
#define R302_ASRC1_RAMPMAX_RAMPMAX_VALUE_IC_1_SHIFT 0

/* ASRC2_RAMPMAX (IC 1) */
#define R303_ASRC2_RAMPMAX_RAMPMAX_VALUE_IC_1     0x7FF  /* 11111111111b	[10:0] */
#define R303_ASRC2_RAMPMAX_RAMPMAX_VALUE_IC_1_MASK 0x7FF
#define R303_ASRC2_RAMPMAX_RAMPMAX_VALUE_IC_1_SHIFT 0

/* ASRC3_RAMPMAX (IC 1) */
#define R304_ASRC3_RAMPMAX_RAMPMAX_VALUE_IC_1     0x7FF  /* 11111111111b	[10:0] */
#define R304_ASRC3_RAMPMAX_RAMPMAX_VALUE_IC_1_MASK 0x7FF
#define R304_ASRC3_RAMPMAX_RAMPMAX_VALUE_IC_1_SHIFT 0

/* ASRC4_RAMPMAX (IC 1) */
#define R305_ASRC4_RAMPMAX_RAMPMAX_VALUE_IC_1     0x7FF  /* 11111111111b	[10:0] */
#define R305_ASRC4_RAMPMAX_RAMPMAX_VALUE_IC_1_MASK 0x7FF
#define R305_ASRC4_RAMPMAX_RAMPMAX_VALUE_IC_1_SHIFT 0

/* ASRC5_RAMPMAX (IC 1) */
#define R306_ASRC5_RAMPMAX_RAMPMAX_VALUE_IC_1     0x7FF  /* 11111111111b	[10:0] */
#define R306_ASRC5_RAMPMAX_RAMPMAX_VALUE_IC_1_MASK 0x7FF
#define R306_ASRC5_RAMPMAX_RAMPMAX_VALUE_IC_1_SHIFT 0

